{
  "response": [
    {
      "User": "efrenr916",
      "Location": "Taguig City, Philippines",
      "DateofReview": "February 27, 2018",
      "ReviewTitle": "The best place for chilling in Davao",
      "Review": "The place offers a wide variety of restaurants, bars, and night spots. The most popular is \"Kanto\" with a live band performance. Bands are rated and allows jamming and dancing. Wide variety of delicious pica picas and beers from all over. Smoking area at the parking area."
    },
    {
      "User": "paulapple",
      "Location": "england",
      "DateofReview": "February 9, 2018",
      "ReviewTitle": "Lively",
      "Review": "Good atmosphere. Plenty of food choices. Live music and beer what’s not to like. Many young people but a good atmosphere. Highly recommended"
    },
    {
      "User": "Valdis A",
      "Location": "Kremenchuk, Ukraine",
      "DateofReview": "January 4, 2018",
      "ReviewTitle": "Live band show!",
      "Review": "Coming here to the central big stage hall for live band performances on weekend. Great bands, great sound, great ambiance. \r Lots of small bars/restaurants around with own designs and entertainment.\r bucket of beer is only P250\r Always crowded. \r You definitely will find something special up to your taste.\r If you using a taxi - better give small bills like P20 to the parking boys to get you a cab fast. Otherwise you will wait long especially on weekends."
    },
    {
      "User": "lionlamica",
      "Location": "Florida",
      "DateofReview": "November 9, 2017",
      "ReviewTitle": "Alot of food choices",
      "Review": "Went to check out BLUGRE durian coffee and Aling Fopings halo halo. Well me and my daughter got the durian coffee and it was not that good to us, I like durian but not in coffee. The staff were nice and the place had great ac and was very clean. I would go back but next time I would get something else. The halo halo at aling fopings was just ok and you have to pick your toppings just make sure you get them we did not get all of ours. Would I go back may be but not for the halo halo."
    },
    {
      "User": "Tony_King_Jr",
      "Location": "Davao City, Philippines",
      "DateofReview": "November 9, 2017",
      "ReviewTitle": "Good place to eat and enjoy",
      "Review": "The place is very accessible, you can commute or drive your car. Lots of restaurant to choose. Good place to enjoy the music and food."
    },
    {
      "User": "Amy S",
      "Location": " ",
      "DateofReview": "November 8, 2017",
      "ReviewTitle": "HALOHALO AT MATINA TOWN SQUARE",
      "Review": "For those who want to enjoy the local dessert halohalo, try visiting Matina Town Square. You can create your own halohalo! The place is always very busy. Enjoy your visit!"
    },
    {
      "User": "Nancy A",
      "Location": "Davao City, Philippines",
      "DateofReview": "October 27, 2017",
      "ReviewTitle": "Haven Gig",
      "Review": "I live near Matina Town Square. The reason I called it \"haven gig\" is because we come to this place in Davao City, Philippines as often as we could just to hang out.......So many restaurants to choose from....BUT a must try \"halo-halo\" from Aling Foping is to die for (not literally)........adults, kids, senior citizens...all these people are welcome❤️"
    },
    {
      "User": "Mia P",
      "Location": "Mandaluyong, Philippines",
      "DateofReview": "August 29, 2017",
      "ReviewTitle": "Good place to eat",
      "Review": "Matina Town Square is very accessible and is easy to find. It's in front of Ateneo High School and is just walking distance from NCCC Mall. The place houses various restaurants and coffee shops and even offers some night life until midnight (since there's curfew in Davao). I recommend Taste of Home and Aloha Bar for dinner, and BluGre Coffee for the best Durian Coffee you can ever taste. :) "
    },
    {
      "User": "Vanessa D",
      "Location": " ",
      "DateofReview": "August 16, 2017",
      "ReviewTitle": "Lots of activities ",
      "Review": "Lots of activities to do. Many places to eat. Nice and beautiful. Very accessible. Coffee shops to restaurants, fast food chains and bars. Really nice."
    },
    {
      "User": "Jamal A",
      "Location": "Kuala Lumpur, Malaysia",
      "DateofReview": "August 12, 2017",
      "ReviewTitle": "many places to eat",
      "Review": "a lot of choice of food outlets from quiet restos to jumping bars. also a nice dessert place. HALO-HALO to your choice"
    },
    {
      "User": "CheParacuelles",
      "Location": "Davao City, Philippines",
      "DateofReview": "July 31, 2017",
      "ReviewTitle": "You want to chill a little bit? Matina Time Square will give you that",
      "Review": "My bestfriend and I were just roaming around Davao for a day, looking for a place to eat so we ended up in MTS. Since my college days, I have been to MTS for how many times and for the span of 15 years, there's...More"
    },
    {
      "User": "rmbautista",
      "Location": "Ho Chi Minh City, Vietnam",
      "DateofReview": "July 23, 2017",
      "ReviewTitle": "Davao chilling out",
      "Review": "MTS good place to have cheap and good food with great music. The Don band on sundays is a must. Check out the sizzling Bangus of the boss BBQ and the goat dishes of goats eye. The pork BBQ of boss is kinda disappointing. We...More"
    },
    {
      "User": "Althea-CZ",
      "Location": "Iloilo City, Philippines",
      "DateofReview": "July 18, 2017",
      "ReviewTitle": "Night Chill",
      "Review": "The place is full of restos and entertainment bars. It is very accessible and easy to find since it is just in front of Ateneo de Davao Grade school campus. We stayed at Blugre Cafe but you can hear and see the kind of night...More"
    },
    {
      "User": "Ray T",
      "Location": " ",
      "DateofReview": "May 28, 2017",
      "ReviewTitle": "Fun packed, with plenty of eating/drinking options",
      "Review": "Fun place to go at night time. The main band can be loud, but they were good. And there are several other bar options."
    },
    {
      "User": "falthaher",
      "Location": "Cebu City, Philippines",
      "DateofReview": "May 6, 2017",
      "ReviewTitle": "Lovely Times",
      "Review": "I had the pleasure to visit this place (KANTO) on Saturday night, 10 pm, I had my dinner (Boneless Grilled Chicken), listened to a nice life band including jazz 🎶 music. The food was great, reasonably price. Overall atmosphere was great."
    },
    {
      "User": "DVOpommy",
      "Location": "Davao City, Philippines",
      "DateofReview": "May 4, 2017",
      "ReviewTitle": "Cool for tourists but very much same same",
      "Review": "A collection of restauants surrounding a center stage with live (very loud) music). Fun to viit if you are new to town but there is little istinction between eat of the restaunts in terms of food choice."
    },
    {
      "User": "reelrodcover",
      "Location": "Montgomery, Texas",
      "DateofReview": "April 12, 2017",
      "ReviewTitle": "Fun time",
      "Review": "Saw a number of performances of great performers and great food and drinks. Put this one on your list to visit."
    },
    {
      "User": "costelmihaila80",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "Vancouver, Canada",
      "Location": "Vancouver, Canada",
      "DateofReview": "March 9, 2017",
      "ReviewTitle": "Safe place",
      "Review": "Is near a good sized mall. Went there and had a facial.Food is pretty cheep and the people are friendly. A place worth to visit"
    },
    {
      "User": "Eloise T",
      "Location": " ",
      "DateofReview": "January 30, 2017",
      "ReviewTitle": "great time!",
      "Review": "I love davao because there's no smoking and matina town square is fun though very dark too many mosquitoes, fun oldies music the last time we went, great time. i would go back!"
    },
    {
      "User": "DonDan16",
      "Location": "Hamburg, Germany",
      "DateofReview": "January 22, 2017",
      "ReviewTitle": "No reason to go there ",
      "Review": "Restaurants, Cafés, small stores. I don't understand why this should be an attraction. There is nothing special to buy or see."
    },
    {
      "User": "MijnlieverdFH",
      "Location": "Amsterdam",
      "DateofReview": "December 30, 2016",
      "ReviewTitle": "Just an experience... Satuday night out!",
      "Review": "Be there earlier or you have a problem where to park your car. There are many younger people around, Good music and good food. Varied cuisine to choose from. I can bring friends next time around specially those that are inclined to love good music...More"
    },
    {
      "User": "SimonDabbs",
      "Location": "Melksham, United Kingdom",
      "DateofReview": "December 17, 2016",
      "ReviewTitle": "Nice place to hang out for an evening, with everything you need.",
      "Review": "Basically, this is an area where people go to have fun in the evening. Fridays and Saturdays are busy, and if you are coming by car, parking can be a problem. There are loads of bars, and all kinds of unpretentious restaurants, many of which...More"
    },
    {
      "User": "Anjeanette R",
      "Location": " ",
      "DateofReview": "October 20, 2016",
      "ReviewTitle": "GREAT!",
      "Review": "i am always here with my friends late in the evening and have some chill music and drinks! the ambiance is nice too!"
    },
    {
      "User": "maryjoy0408",
      "Location": "Toril, Philippines",
      "DateofReview": "October 20, 2016",
      "ReviewTitle": "good place",
      "Review": "been there often,sometimes with friends,service is good as well as the food,calda pizza is yummy and so big,and my 1st tattoo was done there at redstar tattoo,at the 2nd floor"
    },
    {
      "User": "Susana D",
      "Location": "Quezon City, Philippines",
      "DateofReview": "October 19, 2016",
      "ReviewTitle": "Good for night out with good company...",
      "Review": "Very accessible, just along the highway. Complete with boutique shops, a convenience store, coffee shops, juice bar, and a food court with varied food outlets and a stage for performers/bands."
    },
    {
      "User": "JamesKoh",
      "Location": "Singapore, Singapore",
      "DateofReview": "October 12, 2016",
      "ReviewTitle": "Cheap Food and Live Music",
      "Review": "Good place to have dinner if you visit Davao. Food is cheap and there are a lot of variety to order from."
    },
    {
      "User": "Ben99999999999999999",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "Swansea, United Kingdom",
      "Location": "Swansea, United Kingdom",
      "DateofReview": "October 7, 2016",
      "ReviewTitle": "Beer and Music",
      "Review": "Beer, food and music, enjoyed, live band playing, worth a visit, as there is not much night life in Davao........good pizza there"
    },
    {
      "User": "filipin0traveller",
      "Location": "manila",
      "DateofReview": "September 30, 2016",
      "ReviewTitle": "Food Galore",
      "Review": "Varied food options. There is also a cafe that serves durian cake which is unique in Davao. A band also gives good music. A safe place that provides night life"
    },
    {
      "User": "Butterflyonmyleg",
      "Location": "Muscat, Oman",
      "DateofReview": "August 25, 2016",
      "ReviewTitle": "A place to mingle with Dabawenyos",
      "Review": "A nice place to relax and mingle with Dabawenyos while listening to the oldies music. There are a lot of nice restaurants around but we chose the first one next to the stage on left side - I forgot the name but the food was...More"
    },
    {
      "User": "Lina Gladys L",
      "Location": "Manila, Philippines",
      "DateofReview": "August 23, 2016",
      "ReviewTitle": "matina town square is a nice to hang out place",
      "Review": "MTS is a nice place and affordable place to hang out with friens. the shop with the famous halo halos is there. there is band and good music and the bars are very affordable"
    },
    {
      "User": "Darryl G",
      "Location": " ",
      "DateofReview": "August 10, 2016",
      "ReviewTitle": "Night out food coffee halo2x ",
      "Review": "Night out with friends. Bands every night. There's a coffee shop that's been there like forever. Favorite is aling fopings,Serves best halo2x by far"
    },
    {
      "User": "joww101",
      "Location": " ",
      "DateofReview": "August 5, 2016",
      "ReviewTitle": "Been here",
      "Review": "Been here for 4 yrs. I actually like this place for chilling. Listening to music and hang out with friends. The food is delicious! I recommend this for tourist."
    },
    {
      "User": "Melle R",
      "Location": " ",
      "DateofReview": "July 26, 2016",
      "ReviewTitle": "Nice place to hang out",
      "Review": "MTS is the place to be if you want to have a taste of Davao night life. I am a dabawenya and I'd say I go here almost every week not just to drink but also to eat. This is a nice place to meet...More"
    },
    {
      "User": "Jay S",
      "Location": "Davao City, Philippines",
      "DateofReview": "July 26, 2016",
      "ReviewTitle": "One of the best places to go in Davao if with friends and family!",
      "Review": "One of the best places to go to with friends and family. It has an area where a live band or a live group is entertaining the crowd. Adults usually go here for a few beers and good food. Families or groups of people who...More"
    },
    {
      "User": "Markus N",
      "Location": "Oslo, Oslo, Norway",
      "DateofReview": "July 15, 2016",
      "ReviewTitle": "Great fun",
      "Review": "I went here with my wife as we visit Davao and wanted some nightlife fun. We heard that MTS were a great place for such event and we took a taxi getting there. First of all, the accessability was great, you could grab a taxi,...More"
    },
    {
      "User": "Mark L",
      "Location": " ",
      "DateofReview": "July 13, 2016",
      "ReviewTitle": "Good",
      "Review": "This place is so accessible it just located near the highway and there are a lot of restaurants, bars and cafe located inside."
    },
    {
      "User": "tolentinomaldex",
      "Location": "Cagayan de Oro, Philippines",
      "DateofReview": "July 6, 2016",
      "ReviewTitle": "Bars here, there and everywhere",
      "Review": "Very exciting venues for the nightout with family and friends. Diners and drinkers can choose the many food outlets and bars."
    },
    {
      "User": "rickyrose",
      "Location": "pasay, philippines",
      "DateofReview": "July 4, 2016",
      "ReviewTitle": "Food and sound Trip",
      "Review": "Went to MTS just to enjoy the food and music of live band. However, since the place is open, there are plenty of mosquitoes which is a let down. There are also stray cats."
    },
    {
      "User": "Leah E",
      "Location": "Tacloban, Philippines",
      "DateofReview": "July 3, 2016",
      "ReviewTitle": "A little bit of everything",
      "Review": "MTS is the nightlife center of Davao City. Presence of men in uniform from the PNP abound to ensure safety of patrons of the place. Yes, a little bit of everything. Live band performers, restos that cater to varied palates and the popular Aling Poping's...More"
    },
    {
      "User": "777Luis51777",
      "Location": "Boston, Massachusetts",
      "DateofReview": "June 18, 2016",
      "ReviewTitle": "Happy hours!",
      "Review": "A better place to spend at night passing the hour eating and drinking with friends, enjoying live bands. Coffee, beers, whiskey, tea, almost all drinks are served here so with pizzas to grilled dishes of your choice. Parking area is big. A must place to...More"
    },
    {
      "User": "RubenLicera",
      "Location": "Cebu City, Cebu City, Philippines",
      "DateofReview": "June 15, 2016",
      "ReviewTitle": "Fondly Called Duterte Town Center Now!",
      "Review": "It is accepted fact now that these town center of the Philippines president-elect Rody Duterte is now fondly called after his last name. A Good entertainment area packed with bars and gastronomic pub, a trip to this area is a food trip on its own."
    },
    {
      "User": "aprilsky2016",
      "Location": "Davao City, Philippines",
      "DateofReview": "June 9, 2016",
      "ReviewTitle": "Listening to slow rock and roll music.",
      "Review": "This is one of the safest destination in Davao City when you, your family or friends want to chill. The only smoke you can smell is that coming from the grilled meats. Very relaxing ambiance with plenty of resto bars to choose from."
    },
    {
      "User": "Aphio1925",
      "Location": "United Kingdom",
      "DateofReview": "May 21, 2016",
      "ReviewTitle": "All in one",
      "Review": "This place has a variety to see. Foods, drinks, music, dance if you like, and a perfect o,ace to meet up with friends"
    },
    {
      "User": "rasecollidab",
      "Location": "las vegas",
      "DateofReview": "May 18, 2016",
      "ReviewTitle": "Nothing Special ",
      "Review": "I came in a wrong time,there was a religious rally of some sort next door,lots of kids and loud noise blasting throughout the area,I stayed for about 45 minutes and left very disappointed."
    },
    {
      "User": "Leah N",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "Davao City, Philippines",
      "Location": "Davao City, Philippines",
      "DateofReview": "May 17, 2016",
      "ReviewTitle": "Hangout Place",
      "Review": "My family and I would visit this place, often once a month and sometimes twice a month. It has a number of restaurants, food kiosks and other non-food shops. Prices are affordable and live/loud music is also played."
    },
    {
      "User": "Talentscrib",
      "Location": "Philippines",
      "DateofReview": "April 25, 2016",
      "ReviewTitle": "Nice square wit livebands",
      "Review": "Great square of restaurants and cafes... Liveband performance adds to the energetic vibe where you will see good happy people"
    },
    {
      "User": "flxmanuel",
      "Location": "New York City, New York",
      "DateofReview": "April 21, 2016",
      "ReviewTitle": "too busy",
      "Review": "not for those who want peace and quiet...if you want a sensational night out, this place rocks! food is great and the place is very accessible."
    },
    {
      "User": "slazenger552",
      "Location": "Davao City, Philippines",
      "DateofReview": "April 16, 2016",
      "ReviewTitle": "Good for gimmick and hangouts",
      "Review": "This place is good and enjoyable to stay for gimmicks and to hangout with friends, for dining and drinking or just simply listen to music."
    },
    {
      "User": "nmc8693",
      "Location": "Paranaque",
      "DateofReview": "February 19, 2016",
      "ReviewTitle": "Great Night Spot",
      "Review": "This has always been a great hangout place for both locals and tourists ! Theres a wide range of restos, bars that caters across various preferences. The sounds of different bands welcome you as you enter the compound. Prices are very very reasonable ! Gotta...More"
    },
    {
      "User": "TheBambino03",
      "Location": "Davao City, Philippines",
      "DateofReview": "January 28, 2016",
      "ReviewTitle": "Matina Town Square is Duterte Square",
      "Review": "I last visited the place early last December 2015, and it was full of life. Various bands and singing quarters rendered their own covers of local and internationally known songs. In this visit, I found out that a building is being erected nearby, this will...More"
    },
    {
      "User": "Argdds",
      "Location": "Davao City, Philippines",
      "DateofReview": "January 24, 2016",
      "ReviewTitle": "Chill",
      "Review": "A Place to Have Fun. I often went here to release some Stress in Life :D Live Band Helps the Place more lively."
    },
    {
      "User": "U3681LTdavids",
      "Location": "Baku, Azerbaijan",
      "DateofReview": "January 17, 2016",
      "ReviewTitle": "A few beers and snacks Filipino style",
      "Review": "Matina Town Square is an older 'entertainment centre' in Davao - I prefer the other one near Torres St. - it's more modern and laid back, but it's a fun place with live bands and a nice bar in the back owned by an English...More"
    },
    {
      "User": "Zen A",
      "Location": " ",
      "DateofReview": "January 6, 2016",
      "ReviewTitle": "Great Place To Hangout With Friends",
      "Review": "The place has open air restaurants. The best time for me to sit down, eat and enjoy the music is during night time. Stalls to buy stuffs and fast food restaurants and a coffee shop can also be found within the area. Enjoy!"
    },
    {
      "User": "AniMei1",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "Bacolod, Philippines",
      "Location": "Bacolod, Philippines",
      "DateofReview": "December 23, 2015",
      "ReviewTitle": "great place!",
      "Review": "My sis has read about the place and our cousin from Davao recommended it to us. We had dinner there on our last night but didn't get to hear or see any band play because of a power interruption which lasted for more or less...More"
    },
    {
      "User": "HurricaneRob",
      "Location": "Houston, Texas",
      "DateofReview": "December 3, 2015",
      "ReviewTitle": "Close to Domeicilo",
      "Review": "Had a couple of nice restaurants, midnight convenience store, location to get your Eden Natue park tickets"
    },
    {
      "User": "AlbertodelaPaz",
      "Location": "Chiang Rai, Thailand",
      "DateofReview": "December 2, 2015",
      "ReviewTitle": "Very relaxing venue for night owls",
      "Review": "I lived near this place but dreaded going there because I thought it would be crawling with yuppies. How mistaken I have been! A friend of mine whom I had not seen for many many years suggested we go there - lo and behold, it...More"
    },
    {
      "User": "applebelt",
      "Location": "Davao City, Philippines",
      "DateofReview": "November 30, 2015",
      "ReviewTitle": "Music's so loud",
      "Review": "The Taboan is really great, has lots of choices for restaurants and the service is great. The only thing is that the music is so loud, I can't even hear my seatmate talking. Overall it's okay."
    },
    {
      "User": "JOY_LITTLE_ALIEN",
      "Location": "Singapore, Singapore",
      "DateofReview": "November 13, 2015",
      "ReviewTitle": "My favorite",
      "Review": "This is my favorite place to hangout when I was still studying. The place turns to a flea market on fridays and saturdays. But coffee shops and an open bar is what adds up to a great stay at MTS."
    },
    {
      "User": "Chrïstïnę B",
      "Location": "Sweden",
      "DateofReview": "November 5, 2015",
      "ReviewTitle": "Chill and Listen to Music",
      "Review": "This is the place where you want to chill. Small Beer and Listen to Music :) Smoke Free Place DAVAO CITY 4th SAFEST PLACE IN THE WORLD POLICE ARE ALWAYS DOING THEIR ROUNDS! ARMY ARE ALWAYS ATTENTIVE Entrance, they have a check point/ walk ins...More"
    },
    {
      "User": "Tolits09",
      "Location": "Davao City, Philippines",
      "DateofReview": "October 20, 2015",
      "ReviewTitle": "Nice place for gimmick with friends",
      "Review": "We kept coming back to this place. Lots of people come here specially Friday and Saturday. Parking is a real problem here, Nice festive atmosphere. Local bands play here. Recommended sa mga magbarkada"
    },
    {
      "User": "RodgerOndat",
      "Location": "Chiang Rai, Thailand",
      "DateofReview": "October 16, 2015",
      "ReviewTitle": "Really Wonderful Night Spot and not only for Yuppies",
      "Review": "For sooo long, I had been avoiding this place because my impression was that it was a yuppie haven. I could not have been more wrong. A long-time friend suggested we go there for a few beers and half way through my first San Miguel...More"
    },
    {
      "User": "Iceman272",
      "Location": "Grafton, NY",
      "DateofReview": "October 16, 2015",
      "ReviewTitle": "Best halo-halo in town",
      "Review": "There's a little place in the back that has the best halo-halo in the city in my opinion. It's pick your own toppings, too."
    },
    {
      "User": "ingmar b",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "Davao City, Philippines",
      "Location": "Davao City, Philippines",
      "DateofReview": "October 15, 2015",
      "ReviewTitle": "for a beer and a laugh the best place",
      "Review": "davao his mayor is very strict. so the nightlife is not so excisting in davao. This is one of the few places where you have lots of bars and restaurnts together. the restaurants are simple.the bars are good.lots of live music. lots of pretty women"
    },
    {
      "User": "Anthony M",
      "Location": "Alameda, California",
      "DateofReview": "September 23, 2015",
      "ReviewTitle": "Multi-Venues",
      "Review": "Nice safe, cheap place to spend the night out no matter what day it is. Visited 3 different nights, bands, music, Zumba, a must see flame twirler, coffee shop, sweets shop, restaurants, complete place."
    },
    {
      "User": "Vince M",
      "Location": " ",
      "DateofReview": "September 20, 2015",
      "ReviewTitle": "Sort of a party venue",
      "Review": "If you are looking for a place to chiill, relax and enjoy and you want music and drinks, this is the place for you."
    },
    {
      "User": "Benbaominh",
      "Location": "Brussels, Belgium",
      "DateofReview": "September 16, 2015",
      "ReviewTitle": "You find everything here !",
      "Review": "Very practical public space with restaurants, pubs, massage centers, hairdressers, nightshops, 24/7 Mc Donald, Jellybee, toilets, a lot of atmosphere during weekends, with some live music."
    },
    {
      "User": "JEmmanuelLasPinas",
      "Location": "Las Pinas",
      "DateofReview": "August 31, 2015",
      "ReviewTitle": "music and food",
      "Review": "This is a fun place has a good vibe that a lot of younger folks like. Go for the music and cheap eats. The place gets crowded in the evenings."
    },
    {
      "User": "Sarah A",
      "Location": "China",
      "DateofReview": "August 25, 2015",
      "ReviewTitle": "perfect for fish food lovers and BBQ",
      "Review": "super food, great atmosphere, a must during a davao visit , perfect for fish food lovers, best to go in big group"
    },
    {
      "User": "Richthof R",
      "Location": "Davao City, Philippines",
      "DateofReview": "July 26, 2015",
      "ReviewTitle": "artisitc freedom",
      "Review": "This is where most of the local band, visual artist, tattoo artist, indigenous culture and arts happen, Where you can Experience Joey Ayala, Jack in the box Davao band Jams with Popong Landero and Kaliwat Music mixed with indigenous culture and arts. Where everything is...More"
    },
    {
      "User": "Dave F",
      "Location": "Melbourne",
      "DateofReview": "July 22, 2015",
      "ReviewTitle": "Fun place for music and food",
      "Review": "Quite a fun plae to go to listen to some live music and have some food. The food could be better but the atmosphere is pretty cool there"
    },
    {
      "User": "Mary Cris N",
      "Location": " ",
      "DateofReview": "July 21, 2015",
      "ReviewTitle": "Saturday getaways",
      "Review": "Love the foods --- if you want pizza, burgers, ice cream, liquors, etc. you can have them all in MTS. Good place to go with on Saturday Nights. Good place to meet new friends and good place to bond with your friends and families."
    },
    {
      "User": "Ma S",
      "Location": " ",
      "DateofReview": "July 14, 2015",
      "ReviewTitle": "some great music",
      "Review": "went there during Kadayawan. had some great bands there. My husband even knew the musicians. reasonably priced drinks also"
    },
    {
      "User": "Miler15",
      "Location": "Davao City, Philippines",
      "DateofReview": "July 13, 2015",
      "ReviewTitle": "MTS",
      "Review": "MTS has undergone a total makeover lately and still one of the destinations of Davao locals for a drink and party and of course food choices. Just opposite Ateneo de Davao gradeschoold and highschool, this place offers party, band, drinks and foods and cafe. But of course, dont forget the Davao city ordinance on curfew and smoking. Definitely MTS offers choices whether whatever time of the day and what you and your friends want."
    },
    {
      "User": "Jeff Z",
      "Location": "Davao City, Philippines",
      "DateofReview": "July 10, 2015",
      "ReviewTitle": "Music, Booze, Great spot",
      "Review": "When night comes and friends want to grab something to drink, this is the first choice that comes to mind. Expect that there will be lots of people but you will always find a place to sit... if you're lucky that is. Or just simply ask someone (a friend?) to reserve a spot. Either way, this is one of the many places you can go and hangout with the group... at night of course."
    },
    {
      "User": "Sheena F",
      "Location": "Cebu Island, Philippines",
      "DateofReview": "July 8, 2015",
      "ReviewTitle": "Lively Davao!",
      "Review": "I had to double check the time when I went here cause for someone who came from a city where party starts at 12mn, this place surely suprises a lot. We arrived at around 8pm on a saturday night. there were already people drinking and bands playing. The place has an array of restaurants to choose from. It also has coffee shops and drinking places. \r \r I love that people can only smoke at designated areas (which was actually the parking lot). The place is also safe. You can see police officers roaming around the place. Plus Davao observes a very strict curfew and strict rules on drinking. \r \r Come here if you just wanna hang out,eat good food, hear music and laugh around with your friends! :)"
    },
    {
      "User": "dorabelladc",
      "Location": " ",
      "DateofReview": "July 3, 2015",
      "ReviewTitle": "davao city vibe at night",
      "Review": "different bands perform each night. there are restaurants, bars, even coffeeshops available in the area. I love aling Foping's! i dont know about other davaoenos but I love their halohalo. you are given the freedom to choose what ingredients you'd like to be added."
    },
    {
      "User": "Xammeloic I",
      "Location": " ",
      "DateofReview": "July 2, 2015",
      "ReviewTitle": "Recreational and entertaining place...fun",
      "Review": "Liked the place especially because my husband love it so much.food and drinks are worthy of price.I'm not just fun of very loud music except if there's dance floor...overall was a great late night out."
    },
    {
      "User": "Iamissa",
      "Location": "Cebu City, Philippines",
      "DateofReview": "June 25, 2015",
      "ReviewTitle": "Disciplined Night Life",
      "Review": "That title sounds like a kill joy but the first thing my companions told me about this place was we ought to leave at 12 midnight. They have rules in Davao about curfew and the authorities impose it strictly. \r \r It's a bustling place at night. I was able to do a lot of things like shopping, eating, and more eating. It's a good place to hang out to kill time but not to catch up with friends as it can get really noisy - as expected in party zones. \r \r Word of advice: don't shop here if you're a tourist, unless you have nothing else to wear the next day."
    },
    {
      "User": "Jan B",
      "Location": "Davao City, Philippines",
      "DateofReview": "June 12, 2015",
      "ReviewTitle": "dense!",
      "Review": "densely populated zone in Davao... too many people out there that you have to be on extra precaution upon walking the sidewalk.. although people are well disciplined in this city but still not recommended to walk alone and not alert all the time."
    },
    {
      "User": "WanderLustDavao",
      "Location": "Davao City",
      "DateofReview": "June 7, 2015",
      "ReviewTitle": "Nightlife every night",
      "Review": "Whether u want to dine, drink or be entertained, every night is a good night to visit MTS. We usually go there to have coffee at BluGre, enjoy dinakdakan and beer at Taboan, sample Black Burger at The Stairwell or savor Aling Foping's Halo Halo."
    },
    {
      "User": "Albert A",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "Quezon City, Philippines",
      "Location": "Quezon City, Philippines",
      "DateofReview": "May 12, 2015",
      "ReviewTitle": "Durian Delight",
      "Review": "The place is a pot of flavors and eats, depending on the caterer that serves you, you'll get a variety of specialty dishes. Don't forget to eat as much durian as you can. There are places next to the chinese arch where you can sample the different varieties of Durian. Wear the plastic disposable gloves so you won't mess your fingers, and drink cold Coke. The combination of durian and Coke is WILD!!!"
    },
    {
      "User": "trippingpt",
      "Location": "Makati, Philippines",
      "DateofReview": "April 21, 2015",
      "ReviewTitle": "what a night!",
      "Review": "a place to party hard. a lot of choice on which poison you'd go for. parking lot is ample. i will definitely go to this place again ;)"
    },
    {
      "User": "BertieinDavao",
      "Location": " ",
      "DateofReview": "April 19, 2015",
      "ReviewTitle": "Great place..worth a visit",
      "Review": "Really nice place and a must see when you visit Davao, had a great time listening to the live music, cool and cheap beers..and a great pizza with good, friendly service at Bar and Belly. Lovely halo-halo at Aling F too. Enjoy."
    },
    {
      "User": "Lim P",
      "Location": "Makati",
      "DateofReview": "April 9, 2015",
      "ReviewTitle": "Hot but bearable",
      "Review": "Martina Town Square in south Davao City is a good alternative place for drinks and food but the place is rather hot during summer. We selected Barbeque Boss for food to go with our drinks. This pork barbeque is just like the satay from Malayisia...More"
    },
    {
      "User": "KIKO597",
      "Location": "Manila, Philippines",
      "DateofReview": "April 4, 2015",
      "ReviewTitle": "A Good Alternative to the Tribu K Mindanawan Show",
      "Review": "Since the Mindanawan cultural show is only available on friday and weekends, we decided to go to this attraction because of a scheduled performance of folk dance and music. The performers are students from the schools of Davao and nearby. We loved the music and...More"
    },
    {
      "User": "tbose",
      "Location": "Kolkata (Calcutta), India",
      "DateofReview": "March 31, 2015",
      "ReviewTitle": "Just loved the feel of this place..",
      "Review": "Live bands, the people, food and booze.The best combination in the middle of Davao City.Very lively place and a fun place to be with friends or as a couple.Parking is a really messy affair though."
    },
    {
      "User": "chocomintcookie",
      "Location": " ",
      "DateofReview": "March 24, 2015",
      "ReviewTitle": "A foodie paradise",
      "Review": "You drive to this place in search for a food fix and you get surprised with the choices, that's MTS. If you want beer and barbeque with live band playing, there are plentiful of choices in Taboan, and Jickong's is the locals' favorite. If you...More"
    },
    {
      "User": "Dee D",
      "Location": "Digos City, Philippines",
      "DateofReview": "March 19, 2015",
      "ReviewTitle": "There bands!!!",
      "Review": "We dine here one time. They have an open field on where you can walk around, like you're in a park. You will forget that you're actually at the heart of a city. There bands add to the calming feeling.. Great! You must try the...More"
    },
    {
      "User": "gkfg139",
      "Location": "Davao City, Philippines",
      "DateofReview": "March 15, 2015",
      "ReviewTitle": "A place not only for people who enjoy nightlife",
      "Review": "This is a place boasting with shops, music, and more. Some of the shops here are open even during the day."
    },
    {
      "User": "andionneceleste",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "Quezon City, Philippines",
      "Location": "Quezon City, Philippines",
      "DateofReview": "March 6, 2015",
      "ReviewTitle": "If you're looking for a place to go at night",
      "Review": "Most attractions close early, luckily MTS will be open pretty much all night. It's a good place for a chill, laid-back foodie experience, with live music and maybe a couple of drinks. Lots of food options, mostly affordable."
    },
    {
      "User": "Alex B",
      "Location": " ",
      "DateofReview": "February 10, 2015",
      "ReviewTitle": "Absolutely the place to go to for nightlife",
      "Review": "Absolutely the place to go to for great food, atmosphere and brilliant live music! Food is very cheap and there's a variety of places to choose from. Live music is just an add on bonus to being in the place. Definitely worth a visit when you are in Davao. "
    },
    {
      "User": "KlausDORING",
      "Location": "Davao City",
      "DateofReview": "January 31, 2015",
      "ReviewTitle": "Something for everybody",
      "Review": "MTS is the best place in Davao for fun, relaxing, good food, outdoor, a few drinks, life bands and much more - NOT ONLY for young people. Also for those people who want to feel young. When in Davao - MTS is a must!"
    },
    {
      "User": "Cookie O",
      "Location": "Davao City, Philippines",
      "DateofReview": "December 30, 2014",
      "ReviewTitle": "Weekend hangout",
      "Review": "Matina Town Square aka MTS, is a laid back place with a bunch of BBQ stalls around an open stage area where you can relax and listen to live music with a beer in one hand an a BBQ in the other. The crowd is mostly composed of teenagers and young adults who just want to bask in the open air and eat decently priced food while listening to live music. Besides the BBQ stalls, there are nearby fastfood joints like Jollibee and McDonald's. There are also some decent cafes, sweetshops, restaurants, arts and crafts stores, and travel shops around. On particular days they have mini bazaars where you can find bargain items and clothing.\r \r The venue itself is well maintained. The toilets are properly working, the doors and roads are clean and functional. Security is also decent.\r \r Try this place out during the weekend for more interesting sights or weekdays for a more relaxed vibe."
    },
    {
      "User": "sammer057",
      "Location": "Seattle",
      "DateofReview": "December 8, 2014",
      "ReviewTitle": "Outdoor Music",
      "Review": "Fun relaxing place to hang out, drink a few beers and take in the show!! The bands are electic and the crowd is friendly."
    },
    {
      "User": "Kaye214",
      "Location": "Davao",
      "DateofReview": "December 7, 2014",
      "ReviewTitle": "Okay",
      "Review": "Simply referred to as \"MTS\", this is a collection of mostly bars and simple diners. A lot of locals hang out here especially at night where it can be packed and parking will be hard to find. If going by taxi, no problem. The halo-halo place is popular and you choose what toppings you want on your halo-halo. It is yummy but it seems you pay more for what you get. Still worth to try. There is also an area that usually holds zumba classes which adds to the lively atmosphere. You can also find tour offices, salons and spas on the second floor. Overall an okay place where we go for an errand or particular food. Tourists may find nothing to really do here unless they want to just sit and hang out."
    },
    {
      "User": "Enrique_3333",
      "Location": "Toronto, Canada",
      "DateofReview": "November 25, 2014",
      "ReviewTitle": "It was Okay",
      "Review": "As a tourist, I did not find anything exciting about the Matina Square. I went at night on a weekday. There were lots of live bands playing. It was cool to see some kids break dancing off on their own. \r \r Most people were just seated which made it seem like an average patio location."
    },
    {
      "User": "ChenaVi14",
      "Location": "Davao City, Philippines",
      "DateofReview": "November 4, 2014",
      "ReviewTitle": "Many things to do here",
      "Review": "Aside from the restaurants present in the area, there is also a zumba class during Monday to Thursday that starts at 6:30 pm and only costs 25 pesos per head. Not bad! There is also a massage parlor and a salon on the second floor."
    },
    {
      "User": "Fourth S",
      "Location": " ",
      "DateofReview": "October 28, 2014",
      "ReviewTitle": "A hang-out and so much more!",
      "Review": "I like going here in the afternoons, sitting (and/or reading) in one of the benches in the back. Lots of food choices too!"
    },
    {
      "User": "Angelito P",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "Muntinlupa, Philippines",
      "Location": "Muntinlupa, Philippines",
      "DateofReview": "August 20, 2014",
      "ReviewTitle": "The GIMIK place",
      "Review": "I like Matina Town Square, known to locals merely as \"MTS\" because it shows the soul of Davao. It is a complex of bars and restaurants, one of which has a live bands. Beer and Fingerfood \"Pulutan\" are the standard fare in this busy, fun place. This is also the place where smokers are assigned a smoking area, far away from the generally non-smoking Davawenos. "
    },
    {
      "User": "AyetSalang",
      "Location": "Davao City",
      "DateofReview": "June 24, 2014",
      "ReviewTitle": "Still festive any day of the week",
      "Review": "new restaurants have flocked the square...more modern setup, with more services, shops and entertainment spots. guarded with security personnel."
    },
    {
      "User": "JuliaJav",
      "Location": "Bacolod, Philippines",
      "DateofReview": "May 11, 2014",
      "ReviewTitle": "Night Life",
      "Review": "Great place to be and be seen at night. Lots of food selections and nightly entertainment. If you're in Davao try to drop by this place."
    },
    {
      "User": "MelP160",
      "Location": "Davao City, Philippines",
      "DateofReview": "May 5, 2014",
      "ReviewTitle": "Has Seen Better Days",
      "Review": "I liked it better when it was grassy and open. Now its all covered by tents and it looks old and not well-maintained. Go there for Aling Foping's Halo-halo or the Tuesday night cultural performance."
    },
    {
      "User": "Mishgreeka",
      "Location": "Heraklion, Iraklion, Greece",
      "DateofReview": "April 13, 2014",
      "ReviewTitle": "\"crowded\"",
      "Review": "When we were in Davao last Feb-Apr 2014 they were having a midnight curfew,everything can be open until 12 midnight only.We went to MTS several times at around 10pm & it was packed,nowhere to seat! Band is not good,you can only hear the drums &...More"
    },
    {
      "User": "Dibyne",
      "Location": "Davao City, Philippines",
      "DateofReview": "March 20, 2014",
      "ReviewTitle": "Live band",
      "Review": "Now considered as a family oriented destination in Davao City. their main attraction is Tabuan which features different bands, and the place is surrounded by different bars and grills. Also two of the most popular fastfoods are here: Jollibee and McDonalds"
    },
    {
      "User": "ZhenniJayon",
      "Location": "Manchester, United Kingdom",
      "DateofReview": "February 5, 2014",
      "ReviewTitle": "A bit boring",
      "Review": "It was used to be a live wire of the city. When we were there we actually disappointed because the real beauty of the place has covered by giant food chain and grocery store. Can't even flush the toilets. It was used to be to...More"
    },
    {
      "User": "Trittle L",
      "Location": "Quezon City",
      "DateofReview": "January 18, 2014",
      "ReviewTitle": "Perfect Chill-out Place",
      "Review": "great place to hang out with your friends after a hard day at work or simply touring around..food establishments are numerous and varies w/ reasonable prices. outdoor entertainment by live bands is also an added attraction"
    },
    {
      "User": "lagarista",
      "Location": "Makati, Philippines",
      "DateofReview": "September 24, 2013",
      "ReviewTitle": "Try Barbeque Boss and Blugre Cafe",
      "Review": "Sinuglaw is tasty delicious and cheap. They also have unlimited rice at P15. I like the Durian coffee experience."
    },
    {
      "User": "GlobalGoodTimes",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "Las Vegas",
      "Location": "Las Vegas",
      "DateofReview": "September 15, 2013",
      "ReviewTitle": "Enjoyed a nice meal and local cultural performance!",
      "Review": "Enjoyed a wonderful evening with family eating local BBQ dishes and watching the performance of a local dance troupe performing cultural dances native to the area. Very nice smoke-free environment with plenty of dining and drinking choices. Primarily oriented towards the young adults but fun...More"
    },
    {
      "User": "Angelito P",
      "Location": "Muntinlupa, Philippines",
      "DateofReview": "August 26, 2013",
      "ReviewTitle": "Smokers' Haven",
      "Review": "Had a drink at Taboan. A designated smokers' area is accessible. Nice, in this smoke-free city. A band plays to entertain guests over beer or other alcoholic drinks. And lots of fingerfood choices."
    },
    {
      "User": "Haftelmacher",
      "Location": "Davao City, Philippines",
      "DateofReview": "August 21, 2013",
      "ReviewTitle": "Basket ball court",
      "Review": "It is very hot, noisy their basket ball court and poor gastronomie, to drink ok, but I really did not enjoy"
    },
    {
      "User": "Dysanregidor",
      "Location": "Davao City, Philippines",
      "DateofReview": "April 2, 2013",
      "ReviewTitle": "Margarita at Jickong's, the best!",
      "Review": "I'm not really a drinker. My alcohol tolerance is very low, I easily get drunk and I dont like the smell and taste of alcohol so I alcoholic drinks is a big no no to me. But whenever I and my friends decides to have...More"
    },
    {
      "User": "JenAspacio",
      "Location": "Manila, Philippines",
      "DateofReview": "March 29, 2013",
      "ReviewTitle": "A good place to hang out but a little old for my taste",
      "Review": "I love that I can find Blugre Coffee there. Too bad they don't have washroom inside the coffee. Because it's the only place I go to Matina for (and the convenience store). But Matina Town Square looks old for my taste."
    },
    {
      "User": "Glentoy",
      "Location": "Davao City, Philippines",
      "DateofReview": "March 22, 2013",
      "ReviewTitle": "A place where most people go for a night out",
      "Review": "MTS is like the only place in the city where people flock to drink and listen to the band while playing the music. Do not expect too much as there is nothing much to do here. During weekdays, the band plays boring music. Good venue...More"
    },
    {
      "User": "PrincessMiaGirl",
      "Location": "Davao City, Philippines",
      "DateofReview": "December 10, 2012",
      "ReviewTitle": "night escape",
      "Review": "musical bands are playing nightly.. night bazaars almost every weekend.. a line of resto grills and bars to choose from.. and a child-friendly tiny park for familes with children.. place is secured too"
    },
    {
      "User": "ukjeprox",
      "Location": "Davao",
      "DateofReview": "November 6, 2012",
      "ReviewTitle": "Under construction",
      "Review": "Matina Town Square is being renovated at the moment so difficult to say much about it. From what I saw it looks a lively night spot with bars and eating places. Will be good when it's finnished."
    },
    {
      "User": "yazhel",
      "Location": "Davao City, Philippines",
      "DateofReview": "October 3, 2012",
      "ReviewTitle": "noisy",
      "Review": "just for the people who love partying and being drunk all night, its not really a classy place, most are trouble makers"
    },
    {
      "User": "sleep00walker",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "Vienna, Austria",
      "Location": "Vienna, Austria",
      "DateofReview": "September 22, 2012",
      "ReviewTitle": "Music and Food",
      "Review": "A cool place to dine out with friends, lots of different food styles and a nice band playing. Go early cause they stop sooner than on other islands (around 1:30am). If you want conversation find a table in the back. If you're a smoker be...More"
    },
    {
      "User": "Lei P",
      "Location": "Taguig City, Philippines",
      "DateofReview": "July 22, 2012",
      "ReviewTitle": "2AM Curfew - Not For Party Animals",
      "Review": "We went here at around 11PM to relax after our strenuous itinerary. I just want to drink a couple of beers and eat some local food. There's a live band playing. It's ambiance is similar to Central of Manila. After we ate our dinner at around 15 past midnight, we ordered 2 buckets of beers. At 1AM, the band stopped playing and some restos closing. At 1:45AM, you can only imagine how my friends reacted when they started to turn off all the lamp posts. I'm indifferent but my friends were so pissed off. The following day, we decided to hit the place at around 7PM. By the way, they only have one smoking area so be prepared for a little inconvenience. "
    },
    {
      "User": "aki0618",
      "Location": "Manila, Philippines",
      "DateofReview": "July 11, 2012",
      "ReviewTitle": "noisy",
      "Review": "good food but quite noisy for me , maybe i just dont like the bands playing when we visit"
    },
    {
      "User": "MrsLeeQuezonCity",
      "Location": "Quezon City",
      "DateofReview": "June 8, 2012",
      "ReviewTitle": "Foping's Halo Halo!!!",
      "Review": "MTS is a very small and compact commercial area. Head for the back where a Foping's (not sure about the spelling) cart sells halo halo and bibingka. Generous and delicious ingredients. Yummy!"
    },
    {
      "User": "maia_cyllene",
      "Location": "Cebu City, Philippines",
      "DateofReview": "May 24, 2012",
      "ReviewTitle": "NIGHT OUT!",
      "Review": "I always hang out in MTS. Barbeque Boss serves cheap but delicious barbeque. Beers are served ice-cold always.\r \r Whistletop is also nice. Although service crew is a little slow at times.\r \r Bazaars are seen on Fridays. Pre-loved stuff and other products.\r \r A good place to chill with friends!"
    },
    {
      "User": "inabear",
      "Location": "Laguna Province, Philippines",
      "DateofReview": "May 11, 2012",
      "ReviewTitle": "Nice hang out",
      "Review": "As a tourist destination, it's not much. Just a playground for the kids (although mine really loved it), a few shops and several restaurants. However, as a place to hang out, eat bbq, have a couple of beers and watch some local bands, it is ideal. I think MTS is better appreciated if you are a local, or if you've been to Davao many times and just want to hang out someplace to unwind. Or, if there is a special event like during Kadayawan."
    },
    {
      "User": "joeydvm",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "Ha'il, Ha'il, Saudi Arabia",
      "Location": "Ha'il, Ha'il, Saudi Arabia",
      "DateofReview": "April 20, 2012",
      "ReviewTitle": "music indeed",
      "Review": "from jazz, to acoustic, reggae, pop, ballads, rock, new wave etc. you name it they do have it, just be aware of the days where each genre is being played"
    },
    {
      "User": "Bluecarrot2020",
      "Location": "Singapore, Singapore",
      "DateofReview": "Reviewed 1 week ago ",
      "ReviewTitle": "Small, accessible location",
      "Review": "Abreeza Mall is a convenient place to shop and eat when staying at Seda Hotel in JP Laurel, Davao City. It is right across the hotel. There are a number of restaurants to choose from for lunch and dinner- fastfoods, regular dine-in e.g, Japanese (Sumosan), Shakey’s, Jollibee, Yellow Cab, For snacks and coffee, you can go to Starbuck’s , J.Company , Dunkin Donuts or one of the food stalls/carts like Fruits in Ice Cream, etc. Most of the shops are those found in Manila. Foreign brands are present - Mango, Esprit, Gap, Giordano, Charles & Keith, Hush Puppies, H&M, etc. A few interesting local brands are available like Chimes, Cocoon (nice formal wear at reasonable prices), Just G (for tweens and teens), Mendez. There are gadget shops on the upper floor. There is also a Robinson’s Dept Store (poor rating for me) and a Robinson’s Supermarket (good rating for me). If you just want to stroll around, mall is ok but if you want to shop, try other malls. "
    },
    {
      "User": "David T",
      "Location": "Christchurch, New Zealand",
      "DateofReview": "Reviewed 4 weeks ago ",
      "ReviewTitle": "Excellent ",
      "Review": "A great mall with all kinds of products westerners are used to seeing. Very good choice of restaurants and the prices are excellent too."
    },
    {
      "User": "doctorfoxtrot",
      "Location": "Manila Philippines",
      "DateofReview": "Reviewed February 17, 2018 ",
      "ReviewTitle": "Convenient for my weekend vacation ",
      "Review": "This mall has everything. From the medium luxury to basic , you can find it here. Movie theatres , salons , department stores , fast food and restaurants. Security was tight too . Being very near to Seda Hotel , it made my stay convenient and worth it. The Ayala seal of high quality is very evident in this mall . "
    },
    {
      "User": "xheroine1981",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed January 16, 2018 ",
      "ReviewTitle": "World class mall",
      "Review": "- Branded accessories to choose from men's, women's and kids - best cinemas - fantastic restaurants you can choose from seafood, meat, pasta - coffee shops are great - spacious mall"
    },
    {
      "User": "Michelle B",
      "Location": " ",
      "DateofReview": "Reviewed January 11, 2018 ",
      "ReviewTitle": "This mall is a breeze!",
      "Review": "Located in a straight line with 3 other malls. It's conveniently located in the centre of Davao and has shops for everything and everyone! It's a one stop mall with a hotel attached (Seda Hotel)."
    },
    {
      "User": "Mehylander",
      "Location": "Morgantown, West Virginia",
      "DateofReview": "Reviewed January 4, 2018 ",
      "ReviewTitle": "Clean and secure",
      "Review": "A little confusing to get into but it is very secure even for Grab. Security checks the trunk before you arrive at the drop off point. When you are done shopping the many shops, there is a central point where they will help you with your cab or grab ride."
    },
    {
      "User": "Amy A",
      "Location": "Ithaca, New York",
      "DateofReview": "Reviewed January 3, 2018 ",
      "ReviewTitle": "Expanded and improved Ayala Mall in the South",
      "Review": "We enjoyed dining, shopping and having some entertainment in this new expanded and improved Ayala Abreeza Mall in Davao. We saw some shows and some features aside from the usual one does in the mall. Shops and restaurants range from local brands to international chains."
    },
    {
      "User": "Greeg G",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed December 22, 2017 ",
      "ReviewTitle": "Wide Space",
      "Review": "Lots of stores and restaurant to choose from. They always have an activities at the center which make the mall more active. Such as zumba, local product selling and many more."
    },
    {
      "User": "efrenr916",
      "Location": "Taguig City, Philippines",
      "DateofReview": "Reviewed December 11, 2017 ",
      "ReviewTitle": "A travellers ideal go-to Mall",
      "Review": "Ideal location, complete assortment of popular shops and restaurants. Safe, centrally located in business center, accessible, safe, never crowded, nice shop goers, clean toilets. You can find everything. A typical Ayala Mall."
    },
    {
      "User": "Tony_King_Jr",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "Davao City, Philippines",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed November 9, 2017 ",
      "ReviewTitle": "For the brand conscious",
      "Review": "It is a nice mall with a lot of restaurants and stores to choose from, their grocery and department store are not that big but they have a lot of \"branded\" shops/stores. Every month they have mall activities, so you can always expect for something new."
    },
    {
      "User": "lionlamica",
      "Location": "Florida",
      "DateofReview": "Reviewed October 31, 2017 ",
      "ReviewTitle": "Nice big mall",
      "Review": "Lots of stores and restaurants to choose from like samsung,ace hardware and a store called bench which most of the locals seem to like. things at this mall were a little pricey but it's worth a walk around."
    },
    {
      "User": "eh-nd21",
      "Location": "Kuala Lumpur, Malaysia",
      "DateofReview": "Reviewed October 20, 2017 ",
      "ReviewTitle": "Best in davao",
      "Review": "standard wise on par with some mall in other major cities, definitely best in davao in term of size, shop mixture n restaurants"
    },
    {
      "User": "blessie",
      "Location": "New Zealand",
      "DateofReview": "Reviewed October 15, 2017 ",
      "ReviewTitle": "Good Mall",
      "Review": "This mall has a lot of branded shops in it and isn't the cheapest in town. For the \"brand conscious\", this would be a good place to shop. I don't think it's as big as SM Lanang, however, it does cater more for the younger...More"
    },
    {
      "User": "Kimitaka S",
      "Location": " ",
      "DateofReview": "Reviewed September 24, 2017 ",
      "ReviewTitle": "Nice shopping mall",
      "Review": "Abreeza Mall is maybe one of the biggest malls in Davao. From movie theater to restaurants, you can find everything that you need. Since the outside is very hot during daytime, Abreeza Mall is a nice place to stroll."
    },
    {
      "User": "streeteasy55",
      "Location": "New York City, New York",
      "DateofReview": "Reviewed August 7, 2017 ",
      "ReviewTitle": "one stop shop",
      "Review": "one of my favorite shopping malls in Davao city. They have top great brands for fashion/trends as well as great yummy restaurants inside the mall. You can have the taste of the chain brand of food/fast food to mid-scale restaurant. There is a 24/7 fitness...More"
    },
    {
      "User": "Eves Jefferson S",
      "Location": " ",
      "DateofReview": "Reviewed August 4, 2017 ",
      "ReviewTitle": "Nice mall",
      "Review": "Stayed for 2 days in davao and this mall is near where I stayed. I liked it, feels like home. And they have lots of outlets that offers discounts."
    },
    {
      "User": "Januspaggers",
      "Location": " ",
      "DateofReview": "Reviewed July 15, 2017 ",
      "ReviewTitle": "Complete services and entertainment ",
      "Review": "Abreeza is located between other malls (SM, Gmall, Victoria Mall and Robinson's Cybergate), very accessible. There are plenty of things to do, as with other neighbouring malls, however I enjoyed the ambiance more. The only issue is that it's pretty confusing for first timers as...More"
    },
    {
      "User": "boostedbreakfast",
      "Location": "Mactan Island, Philippines",
      "DateofReview": "Reviewed July 11, 2017 ",
      "ReviewTitle": "Awesome Mall Davao",
      "Review": "I got mall not often, for me Abreeza is wow amazing and big. Aircon keeps me gold and I look at big beautiful shops in mall. Thank you Abreeza Mall ❤️❤️❤️"
    },
    {
      "User": "Ryan I",
      "Location": "Cebu City, Philippines",
      "DateofReview": "Reviewed July 5, 2017 ",
      "ReviewTitle": "Run-of-the-mill",
      "Review": "Bought a good pair of running shoes at this mall and found the place almost empty at lunch time. The mall itself looks like it has been there for a while now and that there's really nothing going on in there except to eat and...More"
    },
    {
      "User": "tessamaete",
      "Location": " ",
      "DateofReview": "Reviewed July 5, 2017 ",
      "ReviewTitle": "Abreeza",
      "Review": "The mall was kinda old already in some wing. But i think they are complete coz u can find anything here from tiangges to branded stores. It was a different vibe from the ayala malls that im used to. I suggest that they renovate it...More"
    },
    {
      "User": "Manoi N",
      "Location": "Cebu City, Philippines",
      "DateofReview": "Reviewed July 5, 2017 ",
      "ReviewTitle": "A place to find anything",
      "Review": "It's a place wherein you can find anything, very similar with Ayala in Cebu. Clean and spacious, cool place to walk around and palipas oras when in davao"
    },
    {
      "User": "deeignacio",
      "Location": " ",
      "DateofReview": "Reviewed July 4, 2017 ",
      "ReviewTitle": "it kinda is the same last time i was here",
      "Review": "been away for couple of years and maybe im just used to at the mall wars happening in cebu right now where they have new spot new places to visit new attraction happening trying to beat other malls this and that. abreeza is the same...More"
    },
    {
      "User": "twistedfoodlover",
      "Location": "Makati, Philippines",
      "DateofReview": "Reviewed July 2, 2017 ",
      "ReviewTitle": "It's a Mall ",
      "Review": "Not too sure what good or bad to say about Abreeza it's just a great big Mall like any other great big mall in the country. If ur looking for someone in a mall this is a great options. Xx"
    },
    {
      "User": "JTMFraginal",
      "Location": "Cainta, Philippines",
      "DateofReview": "Reviewed June 2, 2017 ",
      "ReviewTitle": "Ayala Mall in Davao",
      "Review": "High-end brands are in Abreeza Mall making it a shopper's haven in the Davao Provinces. H & M, Mark and Spencer and other quality brands have branches in Abreeza. A supermarket and restaurants are also in the mall for food lovers. Nice place to hang-out...More"
    },
    {
      "User": "randychoy94",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed May 23, 2017 ",
      "ReviewTitle": "Clean and spacious",
      "Review": "One of the best thing I can say about Abreeza is its beautiful foodcourt overlooking the city. It it very relaxing and would provude comfort while you eating. There are alot of things to do in Abreeza. Shopping, beautification, eating, singing to name a few....More"
    },
    {
      "User": "Luke T",
      "Location": "Gingoog City, Philippines",
      "DateofReview": "Reviewed May 21, 2017 ",
      "ReviewTitle": "Great Mall and good food",
      "Review": "The mall was right across the street from our hotel. It was fun to wander around and window shop, Plus there are some good restaurants up on the 2nd and 3 floor. We enjoyed ourselves and was able to buy a case of water for...More"
    },
    {
      "User": "mike321ph",
      "Location": "Manila",
      "DateofReview": "Reviewed May 9, 2017 ",
      "ReviewTitle": "Your Ayala Mall in Davao",
      "Review": "Your Ayala Mall in Davao, conveniently located along JP Laurel Avenue accessible via jeepney, taxi or grab taxi. It has many of the shops and restaurants you have in most malls around the country including a grocery, drugstore, bookstores and a 24/7 convenience store. This...More"
    },
    {
      "User": "falthaher",
      "Location": "Cebu City, Philippines",
      "DateofReview": "Reviewed May 7, 2017 ",
      "ReviewTitle": "Good place to shop & diner ",
      "Review": "Plant of modern shops, lots of food choices including coffee shops and Starbucks, bread talk, tax stand, cinema, games, overall, clean."
    },
    {
      "User": "Franklin C",
      "Location": "Honolulu, Hawaii",
      "DateofReview": "Reviewed May 3, 2017 ",
      "ReviewTitle": "Your typical mall",
      "Review": "Your standard mall, nothing that stood out from the rest of the malls. You have your usual crowds and the sales people were very helpful."
    },
    {
      "User": "Victorianlad",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "Melbourne, Australia",
      "Location": "Melbourne, Australia",
      "DateofReview": "Reviewed February 4, 2017 ",
      "ReviewTitle": "Well run shopping centre with many restaurants",
      "Review": "Abreeza Mall is opposite Seda Hotel and as with almost everything the Ayala Group constructs and operates, it is good quality. While the Robinsons supermarket is smaller than its down the road competitor in SM Lanang Premier, the Robinsons has a reasonable range of dry...More"
    },
    {
      "User": "DonDan16",
      "Location": "Hamburg, Germany",
      "DateofReview": "Reviewed January 18, 2017 ",
      "ReviewTitle": "Nice Mall",
      "Review": "You find everything there you need A huge supermarket, the usual stores. Restaurants of course. Try the Hukad, I love Hukad. They have a Farmer market outside. Everything is clean at Abreeza. They often have events with too much noise."
    },
    {
      "User": "Ajie A",
      "Location": " ",
      "DateofReview": "Reviewed January 16, 2017 ",
      "ReviewTitle": "Best Mall in Davao",
      "Review": "I love this mall because it is not too large but it carries the brands and boutiques that i like. Parking is ample and security is adequate. Shopping here is very conducive because of the relaxed atmosphere. Many eating places to choose from. The last...More"
    },
    {
      "User": "arnolda546",
      "Location": "Cebu City, Philippines",
      "DateofReview": "Reviewed December 29, 2016 ",
      "ReviewTitle": "Nice, chic and cozy mall.",
      "Review": "Small place with chic shoppes and boutiques. Reasonable food establishments and strategically located within Davao."
    },
    {
      "User": "AER84",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed December 20, 2016 ",
      "ReviewTitle": "Small and Cozy",
      "Review": "if you are looking for a Megamall, MOA or Trinoma, this is not it. But Abreeza has its own charm and the place definitely has the most chic in Davao. No Prada here but it does have Debenhams, Lacoste and H&M (very new). Two things...More"
    },
    {
      "User": "Ludgardo Z",
      "Location": "Island of Malta, Malta",
      "DateofReview": "Reviewed November 26, 2016 ",
      "ReviewTitle": "Shopping and eating...",
      "Review": "Large, clean and bustling, the Abreeza Mall is a pleasant visit when in Davao. Present are also several reasonable food establishments."
    },
    {
      "User": "Samy N",
      "Location": " ",
      "DateofReview": "Reviewed November 23, 2016 ",
      "ReviewTitle": "Very nice ",
      "Review": "It's a very nice mall, new, high end, when I was there, they was celebrated some occasion for army award at June 2014"
    },
    {
      "User": "ChenaVi14",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed November 16, 2016 ",
      "ReviewTitle": "Lotsa stores",
      "Review": "I love the fact that Abreeza Mall has a lot of stores that cannot be found in other stores in Davao. Oh and the mall's restrooms are a plus.. Very clean"
    },
    {
      "User": "Cookie O",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed November 15, 2016 ",
      "ReviewTitle": "One of Davao's biggest malls",
      "Review": "The mall was delightfully clean and spacious. There were a lot of toilets and all of them were very modern and clean. The atmosphere overall is pretty good and it's very pleasant to walk around in with all of the stores and decorations, it really...More"
    },
    {
      "User": "Katrina08_23",
      "Location": "Davao City",
      "DateofReview": "Reviewed November 15, 2016 ",
      "ReviewTitle": "NICE!!!",
      "Review": "When your in Davao where there are only several malls, Abreeza mall is one of those that I can recommend if you just wanna hang out. Have some coffee or just do some shopping. It has a great landscape and good resto's to choose from."
    },
    {
      "User": "edikdak",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "SJDM City",
      "Location": "SJDM City",
      "DateofReview": "Reviewed November 2, 2016 ",
      "ReviewTitle": "An Ayalla Mall in Mindanao",
      "Review": "Very spacious, very clean, nice view of the condominium being constructed If you want view the panoramic Davao, choose Abreeza!!!"
    },
    {
      "User": "Cheekie A",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed October 5, 2016 ",
      "ReviewTitle": "Great mall to dine, shop, and relax when in Davao",
      "Review": "Tourists should know that shopping mall culture is big in the Philippines; it's where locals unwind and congregate in their free time. When in Davao, Abreeza Mall is the best place to do this because, not only is it big and with fantastic architecture, it melds greens and open spaces into the space to cloak shoppers in an even more relaxing vibe. Tourists can also shop for locally made food products and goods at the outdoor Asian Fruit Market and at Davao Dwellings at the 3F."
    },
    {
      "User": "Borgyliscious",
      "Location": "Davao City, Davao City, Philippines",
      "DateofReview": "Reviewed October 5, 2016 ",
      "ReviewTitle": "Very Accessable Mall",
      "Review": "Just infront of Redemptorist church.\r Very nice mall, not that spacious compared to manila malls or even with sm lanang premier... But it serves the people well.\r \r Places to eat? They got many... moon cake, grab a crab, etc... Depending on your food trip and budget.\r \r Parking? Average... Did not experience the hassle of finding parking spaces here.\r \r What I do not do here? Groceries... A bit pricey compared to Gmall and VP."
    },
    {
      "User": "Diego D",
      "Location": "Metro Manila, Philippines",
      "DateofReview": "Reviewed September 21, 2016 ",
      "ReviewTitle": "Ayala business indeed.",
      "Review": "This place surely shows how Ayala takes care of it's properties. From the design, quality of business and the location is really superb."
    },
    {
      "User": "C W",
      "Location": "Melbourne, Australia",
      "DateofReview": "Reviewed September 19, 2016 ",
      "ReviewTitle": "Great place to shop",
      "Review": "Loved this shopping mall, it had everything! It is much nicer than the other shopping malls in the city and had all of the major store and food outlets."
    },
    {
      "User": "77Raine27",
      "Location": "Cavite Province, Philippines",
      "DateofReview": "Reviewed September 8, 2016 ",
      "ReviewTitle": "Expected A Lot",
      "Review": "Went to ABREEZA MALL. A bit disappointed. Not the usual Ayala mall that we see in Makati and Alabang. For me, it looks like an ordinary mall. On the 3rd leve; outer part of the mall there are a handful of restos and fastfood area over-looking Davao City. You can feel the cool air breeze. Situated in the ground floor level are the famous fast food chains that we see in Manila"
    },
    {
      "User": "CheParacuelles",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed August 31, 2016 ",
      "ReviewTitle": "Cool ambiance and lots of restaurant to dine with",
      "Review": "Abreeza is the place where we shop, eat, watch movies and just doing wibdo shopping. It has a cool and quieter ambiance than the other malls."
    },
    {
      "User": "Leah N",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed August 24, 2016 ",
      "ReviewTitle": "Worth Going To",
      "Review": "Together with my husband and our children on a Sunday, we went to Abreeza to dine and shop. The place is huge filled with differing shops and kiosks selling a variety of items from food to condo units. One can never ran out of stalls to visit, for both the brand conscious and those who are not. There's also a place in the ground floor area where young kids can enjoy playing without having to shell out money. The mall is clean, the area for strolling and its toilets; airconditioning system works; and the mall can easily be accessed in terms of transport."
    },
    {
      "User": "TonyUy",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed August 23, 2016 ",
      "ReviewTitle": "clean and beautiful.",
      "Review": "It's the best mall in Davao City in terms of cleanliness and functionality, and the cinemas are the best specially the reservation of the seat method. High end stores and quality products are here.\r \r The only problem is that whenever there is a function or event the noise is so loud that you can't seem to get away from it, even when you are in the stores around the area and even when its distant from the event vicinity."
    },
    {
      "User": "MANUEL D",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed August 23, 2016 ",
      "ReviewTitle": "A Mall to Behold",
      "Review": "Nothings beats an all in one place. A view of the magnificent landscape. Food places that Davao is known for. And play places for kids. Seat and relax and shop galore."
    },
    {
      "User": "Argdds",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "Davao City, Philippines",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed August 18, 2016 ",
      "ReviewTitle": "Strolling",
      "Review": "Another way to celebrate friendship, We decided to go abreeza to look for stuff and Resto to eat. A lot of option to choose. Ambiance is good. One thing we're excited at is the H&M stall, though its not yet open but we are looking forward to drop by soon. This is not our frst time to visit Abreeza, But this is my 1st time to give feed back. This is Like an Elite type of shopping centre. "
    },
    {
      "User": "Eemgee",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed August 14, 2016 ",
      "ReviewTitle": "The best mall",
      "Review": "Great mall in Davao. Plenty of store to shop from. Easy to navigate. Host many good restaurant. One of my favorite here in Davao."
    },
    {
      "User": "Darryl G",
      "Location": " ",
      "DateofReview": "Reviewed August 10, 2016 ",
      "ReviewTitle": "Lifestyle ",
      "Review": "Lifestyle mall. Good for shopping. H&m is coming soon so more options. Kids playground is a lifesaver for those with kids"
    },
    {
      "User": "joww101",
      "Location": " ",
      "DateofReview": "Reviewed August 5, 2016 ",
      "ReviewTitle": "Good place ",
      "Review": "Well, i love this type of mall. There is so many brands and beauty shops here that other malls don't have. I love cafes here also. Good for walking and a good place to bring someone or your friends to hang out. And the cinema...More"
    },
    {
      "User": "delight_2016",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed July 28, 2016 ",
      "ReviewTitle": "An Afternoon Abreeza Mall visit and shopping with my g-kids and their Dad",
      "Review": "The place is so cool, spacious and cozy, I like the ambiance.You can see many tourists dining and relaxing , because they know they were safe they were in Durian and Eagle capital of PH being Duterte's place of abode. One can feel so safe...More"
    },
    {
      "User": "Jay S",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed July 26, 2016 ",
      "ReviewTitle": "Best High-End Mall In Davao",
      "Review": "Abreeza mall is the first mall in Davao that focuses on high-end brands. Thus, the people this mall attracts are usually class A and class B. Initially, the mall didn't attract much people due to many vacant spaces. A couple of years after its soft...More"
    },
    {
      "User": "Jill S",
      "Location": "Iloilo City",
      "DateofReview": "Reviewed July 6, 2016 ",
      "ReviewTitle": "High end! Love the shops!",
      "Review": "Abreeza is an interesting place. The shops, the restaurants and more are high end! For brand loving peeps its a good place to shop, some examples are Armani exchange, Tommy Hilfiger, GAP, M&S etc) while the restaurants they have TGIF, hukad and many more if...More"
    },
    {
      "User": "Nancy B",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed June 28, 2016 ",
      "ReviewTitle": "A place to be in downtown davao",
      "Review": "A place to find nice brands (M&S, GAP, Levi's, Mango, Debenhams, Dorothy Perkins, designer Blvd to name a few) & various restaurants like Italianni's, TGI Friday's, shakey's..a hotel just within the compound makes it more practical to go"
    },
    {
      "User": "Bani U",
      "Location": "Puerto Princesa City, Puerto Princesa, Philippines",
      "DateofReview": "Reviewed June 28, 2016 ",
      "ReviewTitle": "A Mall to Mull About!",
      "Review": "The Mall is just across our hotel so we found it very convenient. However, it has more to offer as all the stores we were looking at were there, hence, we found no more need to go to the other malls in Davao. It has...More"
    },
    {
      "User": "Aveeno1991",
      "Location": "Manila, Philippines",
      "DateofReview": "Reviewed June 21, 2016 ",
      "ReviewTitle": "It's a tasty cookie-cutter Ayala Mall - down South",
      "Review": "It sits along a main street where several other malls are located and it is considered the queen among many. If not for the Davao-borne establishments (Tsuru, for one), any mall rat would swear they are either in Glorietta, Trinoma, Ayala Center in Cebu or...More"
    },
    {
      "User": "nprila",
      "Location": " ",
      "DateofReview": "Reviewed June 19, 2016 ",
      "ReviewTitle": "It's like Gloreitta in Davao",
      "Review": "I feel like I am not away from Manila. :). I is like I just in Manila. Except for some stall are stores here In Davao. :)"
    },
    {
      "User": "Nikolai S",
      "Location": "Oslo, Norway",
      "DateofReview": "Reviewed June 14, 2016 ",
      "ReviewTitle": "Great Mall",
      "Review": "The Abreeza Mall covers a lot of your needs in a calm, air conditioned area. We were enjoying our Frappocinos at Startbucks. Great to either sit out or inside. \r \r The dermatology clinic Belo is a great experience, and accomodated us even if we where late. \r \r They offer many cash withdrawal machines (ATM's), luckily because many of them was out of order or did not serve interantional cards(?) \r \r Even going to the toilet area is a pleasant experience. Clean, well maintained by a great staff!"
    },
    {
      "User": "CaliTo69",
      "Location": "Philippines",
      "DateofReview": "Reviewed June 5, 2016 ",
      "ReviewTitle": "Huge & Tiring",
      "Review": "Being an Ayala mall, the design resembles like Trinoma in Quezon City, the design is huge and somehow circular and rectangular which can make you lost or tired due to distance. Many of the stores in Abreeza are not available in Manila."
    },
    {
      "User": "seeingtheworldtoday",
      "Location": "Perth, Australia",
      "DateofReview": "Reviewed June 2, 2016 ",
      "ReviewTitle": "Very clean and modern",
      "Review": "So many exclusive shops and restaurants. The main road is one of the busiest in all of Davao so do expect delays whilst traveling to and from the mall."
    },
    {
      "User": "T767TUrobertb",
      "Location": "New York City, New York",
      "DateofReview": "Reviewed May 30, 2016 ",
      "ReviewTitle": "Upscale mall in Davao",
      "Review": "This is one of the more upscale malls in Davao City. The overall Abreeza compound is still under construction; they are building condos and residential towers within the vicinity of the mall. Your typical stores that you can find in Manila are here."
    },
    {
      "User": "Maia_0515",
      "Location": "Davao City",
      "DateofReview": "Reviewed May 25, 2016 ",
      "ReviewTitle": "My Favorite address",
      "Review": "Abreeza Mall is my favorite place to be when I am hungry, when I need to check on some stuff, find some books, pass the time, take my favorite cup of chai tea latte from coffeee bean, catch up with friends and so on...."
    },
    {
      "User": "Dennies S",
      "Location": " ",
      "DateofReview": "Reviewed May 21, 2016 ",
      "ReviewTitle": "Abreeza Mall The Upscale Mall in Davao",
      "Review": "Abreeza Mall is part of the Ayala Malls chain nationwide and if you say Ayala Malls you expect upscale high end brands for the local market.\r \r Abreeza Mall did not disappoint the delicate taste of Davaoeños. It provided them a haven for shopping and dining pleasure. Some brands are even ahead in Abreeza than Ayala Center Cebu which is considered the shopping mecca of the south. \r \r When in Davao, its a must to visit Abreeza Mall."
    },
    {
      "User": "Marilou Y",
      "Location": " ",
      "DateofReview": "Reviewed May 20, 2016 ",
      "ReviewTitle": "VALET AT ABREEZA",
      "Review": "Of the many malls in Davao City, I frequent the Abreeza mall. Aside from being accessible from home, I go there to relax, see many free activities, exhibits and shows at the atrium. Going to the movies is very convenient and hustle free because of pre assigned seats which could be bought on line or way ahead of time. Usually , when I have nothing to do after my early grocery shopping at Robinsons Supermarket at the the first floor, I while away my time choosing movies to see, order my popcorn and lemonade at TATERS to be delivered to me inside the cinema. There are also fruits in season sold at the foodcourt right besides Taters. There are many shops selling branded clothing and shoes which where once found only in Manila like Mango, M n S, Debenhaus, Dorothy Perkins, Payless, Aldo, Naturalizer, and rows of restaurants at the first, second, and third floor. My grandchildren enjoys playing at the mall covered playground, driving electric cars and riding the electric train. I have eaten in almost all the restaurants in this mall such as Antonio's, Dong Juan, Chikaan, Hukad,Somosan, Shakey's, Sunburst, Chowking, Mang Inasal, J.Co, Army Navy, The Coffee Bean, Italliannis. TGIF, to name a few. Every thursday night the mall offers free zumba class. Fully Booked and National Book Store, as well as Book on Sales are my sources of magazines and books. Abreeza has almost everything to cater our family needs. Many uniformed guards roam around to help secure the mall. These guards are approachable, polite and helpful. Their visibility around the mall makes me feel secure. In front of Robinson Dept Store is a terminal for registered buses and vans coming and going to nearby cities and towns. \r  There are 4 things in Abreeza that make it stand above the rest of the malls :\r  1. The 2 rocking chairs for the senior citizens called SILYA.\r  2. The use of Family Lounge free to senior citizens. \r  3. The many clean toilets and the free toilet papers that that seem not to run out of supply. This sprawling 3 story mall has at least 3 toilets stations ( male , female, Pwd) with many cubicles in every floor. \r  4. This is the only mall that has a valet service."
    },
    {
      "User": "rasecollidab",
      "Location": "las vegas",
      "DateofReview": "Reviewed May 18, 2016 ",
      "ReviewTitle": "Average Mall",
      "Review": "I felt like I'm transported back in the states with all the familiar shops,it's a nice place to cool down and get away from the heat."
    },
    {
      "User": "Brian Chester L",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed April 22, 2016 ",
      "ReviewTitle": "My Frequented Mall",
      "Review": "I always go here to buy groceries, shop, eat out with friends/family or just relax. IMO, this is the only mall in Davao so far that has almost everything a mall rat, fashionista, tourist or businessman would like. You've got a variety of dining options here for the budget conscious, middle class or a high roller. The shops are also varied enough for every budget. One good thing about this mall is also it's open area at the top level where various restaurants with rightly priced food are located. They also have an area for kids in the atrium."
    },
    {
      "User": "SherwinJoseph",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "Luzon, Philippines",
      "Location": "Luzon, Philippines",
      "DateofReview": "Reviewed April 12, 2016 ",
      "ReviewTitle": "Upscale mall; has the Ayala brand",
      "Review": "An Ayala Mall. \r \r The Ayala brand is there. Warm welcome, professional security staff, pleasing and accommodating concierge personnel, and of course the wide and spacious mall. \r \r You can find the best brands here. Ideal place for shopping. Everything you need is here. The mall is accessible via public transportation."
    },
    {
      "User": "larry0123",
      "Location": "Overland Park, Kansas",
      "DateofReview": "Reviewed February 19, 2016 ",
      "ReviewTitle": "best prices",
      "Review": "you can not get a better price for your tourist buck than here. you an even haggle it down from the all ready lowest price.lots of little shops packed together carrying the same stuff like t-shirt shops but there are even furniture shops here. everybody wants your business here so look around then go back to the shop you like the most if they do not have it they might send somebody to go get it from another family member work on other side."
    },
    {
      "User": "MarzDavao",
      "Location": "Almere, The Netherlands",
      "DateofReview": "Reviewed February 18, 2016 ",
      "ReviewTitle": "Still the best mall in Davao",
      "Review": "With the coming of other malls like SM Lanang the competition is very high...Though smaller in sq meters for me Abreeza is still the nicest mall in Davao...Why? because the shop variety is a good mix of restaurants, clothing,shoes, and gadgets etc etc. Everything you need is in Abreeza. Also the people are more upscale then for example. It is also not that crowded."
    },
    {
      "User": "Ralph S",
      "Location": "San Antonio, Texas",
      "DateofReview": "Reviewed January 14, 2016 ",
      "ReviewTitle": "Another nice mall in Davao!",
      "Review": "This mall is a little bit upscale compared to the others in town. We enjoy the good Korean Restaurant in their outdoor garden rooftop section. They also have an interesting looking tuna restaurant there which we will try next."
    },
    {
      "User": "iamatopmodel",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed January 3, 2016 ",
      "ReviewTitle": "Most malls don't have it all. Abreeza does.",
      "Review": "Abreeza remains to be my go to mall in the city. Highend shops offer great discounts at anytime. You don't always notice them because markdowns aren't conspicuous. You gotta get in and check the price tags yourself."
    },
    {
      "User": "majanu",
      "Location": "New York City, New York",
      "DateofReview": "Reviewed December 27, 2015 ",
      "ReviewTitle": "good small mall",
      "Review": "We went to see the Star wars movie, while we were on visit to davao, only 165 peso for movie ticket and you choose your seats, wow, really liked it. Mall has some good and some local stores, i love the fruit vendors they have on 3rd floor. Due to Christmas as usually shopping crowd. Good thing is you can grab taxi by grabtaxi here."
    },
    {
      "User": "Medy1950",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed December 18, 2015 ",
      "ReviewTitle": "No need to go to Manila!",
      "Review": "We have everything here! A modern shopping mall. On my Mom's visit to Davao she remarked \"it is like being in Greenbelt!\" My mom was worried when I retired to Davao with my husband that I would be a probinsyana! Not when I brought her to Abreeza. So there you have it!"
    },
    {
      "User": "Nicolas R",
      "Location": " ",
      "DateofReview": "Reviewed December 16, 2015 ",
      "ReviewTitle": "Perfect place for shopping and dining",
      "Review": "We just hit the sales. Very nice place. Many food options. Every one seems friendly and relax there. Not overcrowded in the afternoon. Easy to get there using public transportation."
    },
    {
      "User": "DulceSweet D",
      "Location": " ",
      "DateofReview": "Reviewed December 15, 2015 ",
      "ReviewTitle": "Happy place!",
      "Review": "I love it! Here u can shop eat and enjoy.. Lots of things to do.. I find this place my happy place whenever im in Davao.. Never a day we don't go here! Its fun fun fun! Esp. Those foods by the roofdeck! Mango singkamas etc! Yummy!!!"
    },
    {
      "User": "Michael L",
      "Location": "Davao, Davao City, Philippines",
      "DateofReview": "Reviewed December 11, 2015 ",
      "ReviewTitle": "The best in Davao",
      "Review": "Abreeza Mall is one of the two more \"upscale\" malls in Davao and offers, at least from my point of view, the best shopping experience in the city for those interested in brand name merchandise. It's got lots of \"designer\" stores familiar in the west, including Tommy Hilfiger, Armani Exchange, the Gap, Guess, Nine West, and some others that can't be found elsewhere in the city. \r \r The mall was built by Ayala, one of the largest developers in the Makati area of Manila and the design expertise of that group is evident in the overall attractiveness of the mall, which is a bit more interesting than the concrete boxes more typical of the mall genre in Davao. Though it's not nearly as interesting nor as sophisticated as Greenbelt in Makati--perhaps Ayala's best known shopping project--it is the most elegant experience that Davao has to offer, and it does provide a clean, attractive ambience in which to shop. Underground parking is abundant and easily accessible and all floors can be accessed via a glass elevator or escalators. \r \r Though the mall offers a number of restaurants catering to a broad range of tastes, it does not feature any of the higher end, intimate restaurants characteristic of Greenbelt, nor does it have the green, landscaped open areas of the latter. Nonetheless, the mall is a viable, welcome addition to the city."
    },
    {
      "User": "Wayne E",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "Canova, South Dakota",
      "Location": "Canova, South Dakota",
      "DateofReview": "Reviewed November 29, 2015 ",
      "ReviewTitle": "A Nice Mall",
      "Review": "If you want to get all your shopping done in one place then this is a nice AC place to do so. Mall prices tend to be slightly higher than elsewhere in the city, but not prohibitively so."
    },
    {
      "User": "Elmo B",
      "Location": "Manila, Philippines",
      "DateofReview": "Reviewed November 22, 2015 ",
      "ReviewTitle": "Cozy, Accessible Mall In Davao City",
      "Review": "Abreeza mall's ambiance is synonymous to that of Glorietta in Makati, Metro Manila and Marquee Mall in Angeles City, Pampanga. Robinson's Department Store and Robinson's Supermarket mainly serves the shoppers here. The wide main hall also is ideal for events."
    },
    {
      "User": "WorldTravelerBill",
      "Location": "Chicago, Illinois",
      "DateofReview": "Reviewed November 14, 2015 ",
      "ReviewTitle": "Great place to shop",
      "Review": "My fiancé took me to Abreeza. Great mall in Davao city. Everything you could want to buy is eat. TGI Fridays and Bigby's are good places to eat. The prices ardent bad either. So if you feel like shopping then this is the place to...More"
    },
    {
      "User": "Rickf1",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed November 11, 2015 ",
      "ReviewTitle": "Convenient stop for coffee, supermarket and currency exchange",
      "Review": "I liked hanging out at Starbucks to remind me of home, robinsons supermarket for fresh fruits and the currency exchange booth near Dunkin donuts. I ate at island seafood, mandarin garden, chikaan, jollibee, etc. Honestly my favorites were the shawarma stand and Filipino dessert counter...More"
    },
    {
      "User": "PeanutButter930",
      "Location": "Cotabato City, Philippines",
      "DateofReview": "Reviewed October 27, 2015 ",
      "ReviewTitle": "ehhhhh...",
      "Review": "well i'm not a luxurious traveller and i'd still go for SM and Gaisano for Malls. Abreeza holds quite expensive stuffs. But it's one of the most beautiful and cozy malls you can try out while in Davao City. maybe around 75 out of 100...More"
    },
    {
      "User": "Iceman272",
      "Location": "Grafton, NY",
      "DateofReview": "Reviewed October 16, 2015 ",
      "ReviewTitle": "Very nice mall",
      "Review": "This mall has some of the pricey shops you might want to check out. There's good eateries upstairs, too."
    },
    {
      "User": "LoviAlterado",
      "Location": "Pasig, Philippines",
      "DateofReview": "Reviewed October 13, 2015 ",
      "ReviewTitle": "Classy and clean mall.",
      "Review": "Me and my son went for a walk and was looking for an arcade near our hotel in Quirino and was told that this mall have one- Timezone. This mall is visually appealing and have classy environment. It has a lot of fast food and...More"
    },
    {
      "User": "Loislim",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed September 22, 2015 ",
      "ReviewTitle": "Classy and yet accessible",
      "Review": "Abreeza, being an Ayala Mall is expected to be classy. Thankfully a standard to follow for the other local malls. Restrooms are cleaner than the other malls. Layout more thought out, but lately so many shops are under renovation or have closed shop? Debenhams, Mango,...More"
    },
    {
      "User": "Vince M",
      "Location": " ",
      "DateofReview": "Reviewed September 20, 2015 ",
      "ReviewTitle": "Arguably classy",
      "Review": "When in Davao City, this place is a must stop if you want to relax and get comfortable of the busy schedules of trips and tours. With arrays of shops for you to enjoy."
    },
    {
      "User": "bulakbol76",
      "Location": "Cebu City, Philippines",
      "DateofReview": "Reviewed September 14, 2015 ",
      "ReviewTitle": "useful stop",
      "Review": "good range of shopping choices, restaurants, cafes, and services. both local and international brands/chains."
    },
    {
      "User": "Lita H",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "Manchester, United Kingdom",
      "Location": "Manchester, United Kingdom",
      "DateofReview": "Reviewed August 22, 2015 ",
      "ReviewTitle": "This is what I call... a proper shopping mall.",
      "Review": "This shopping mall has got everything that you'll probably need when on holiday...For UK citizens, Debenhams and Marks and Spencer have got outlets (and prices are cheaper than the UK, I hasten to add!). The cinemas are of good standard and the food outlets are...More"
    },
    {
      "User": "Dennis Jr C",
      "Location": "Cebu City, Philippines",
      "DateofReview": "Reviewed August 20, 2015 ",
      "ReviewTitle": "Nice",
      "Review": "Nice and clean mall and people are friendly. Public transport is efficient and safe. A one stop shop haven in Davao. Personnel in the mall are very accomodating and friendly. Good experience for me, keep up the good work. Kudos"
    },
    {
      "User": "colhay11",
      "Location": "Bangkok, Thailand",
      "DateofReview": "Reviewed August 11, 2015 ",
      "ReviewTitle": "Just another mall ",
      "Review": "As others have mentioned it's a generic mall like hundreds of others here. All the usual suspects are here under one roof"
    },
    {
      "User": "Franz M",
      "Location": "Manila, Philippines",
      "DateofReview": "Reviewed June 27, 2015 ",
      "ReviewTitle": "First Ayala Mall in Mindanao",
      "Review": "The land used to be a bland lot across Redemptorist Church and I remember, it used to be a venue for selling flower and plant pots. Then it transformed to a mixed-use mall with varieties of shops and restaurants that Davao has never offered before...More"
    },
    {
      "User": "daki237",
      "Location": "Metro Manila, Philippines",
      "DateofReview": "Reviewed June 20, 2015 ",
      "ReviewTitle": "\"My Abreezy\"",
      "Review": "Right in the heart of Davao City and our second home (literally, because it's very near to our house). Right next to this mall is Seda Hotel."
    },
    {
      "User": "saf7670",
      "Location": "Peterborough, United Kingdom",
      "DateofReview": "Reviewed June 10, 2015 ",
      "ReviewTitle": "Just another standard mall",
      "Review": "This is just another standard mall, with nothing special in terms of stores and with its somewhat confusing layout, is not the easiest mall to navigate. Overall a reasonable selection of stores and restaurants."
    },
    {
      "User": "Eddie E",
      "Location": " ",
      "DateofReview": "Reviewed June 7, 2015 ",
      "ReviewTitle": "Grab a crab restaurant ",
      "Review": "If you are in Davao Abreeza Mall go to Grab a Crab restaurant on the third floor just outside the movie Theatre. The food and the service is excellent. My favorite part of the mall. And the prices are very reasonable."
    },
    {
      "User": "AmorSabella",
      "Location": "Davao City Philippines",
      "DateofReview": "Reviewed June 5, 2015 ",
      "ReviewTitle": "Premier Mall in Davao",
      "Review": "Want a relaxing day at the Mall... Abreeza is the place to be.. there are a lot of restaurants that you can choose from. From Local (Blu Gre Coffee, go nut Donuts) to International (starbucks, Krispy Creme)... I love how Ayala Malls include nature in...More"
    },
    {
      "User": "billichka",
      "Location": "Brisbane",
      "DateofReview": "Reviewed May 24, 2015 ",
      "ReviewTitle": "So many food options!",
      "Review": "This mall has many many restaurants and food outlets as well as cinemas and international clothing brand boutiques. If in doubt about where to eat in Davao head here and you cannot go wrong. Several taxi ranks are available and many Jeepneys stop here as...More"
    },
    {
      "User": "kalboHastings",
      "Location": "Hastings",
      "DateofReview": "Reviewed May 4, 2015 ",
      "ReviewTitle": "Modern Large Mall",
      "Review": "Spacious & well laid out Modern larger Mall, 4 floors with plenty of variety of shopping & eatery's. Quite easy to get yourself lost but a nice mall in which to relax & shop out of the searing heat of a summers day"
    },
    {
      "User": "Peter S",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "Tasmania, Australia",
      "Location": "Tasmania, Australia",
      "DateofReview": "Reviewed May 3, 2015 ",
      "ReviewTitle": "4 levels of shopping",
      "Review": "Great place to visit, if shopping is your thing then this is your place. catering mostly to the upper mid to high range market but spacious and well laid out shopping"
    },
    {
      "User": "Jeff Y",
      "Location": "Makati, Philippines",
      "DateofReview": "Reviewed April 22, 2015 ",
      "ReviewTitle": "Excellent place to unwind",
      "Review": "Conveniently located in the center of Davao City, this medium-sized mall has a slew of outlets and restaurants which makes it easy for visitors to kill time in. We were lucky when we visited Davao that they were having a sale thus my wife ended buying stuff which she needed at good prices. Clean,accessible with a varied range of shops to choose from . Perfect for any visitor to Davao City."
    },
    {
      "User": "islandtravelph",
      "Location": "Taguig City, Philippines",
      "DateofReview": "Reviewed April 18, 2015 ",
      "ReviewTitle": "breezing davao!!!",
      "Review": "ayala center in davao, enticing place to chill and relax in the city of davao :) great people around and clean city."
    },
    {
      "User": "slazenger552",
      "Location": "Davao City, Philippines",
      "DateofReview": "Reviewed April 14, 2015 ",
      "ReviewTitle": "Good place to meet up with friends",
      "Review": "This place is good for friends to meet up, dine and stroll. There are lots of variety of restos, boutiques, etc. The supermarket is also well-organized."
    },
    {
      "User": "Cot U",
      "Location": " ",
      "DateofReview": "Reviewed April 4, 2015 ",
      "ReviewTitle": "Chill & Unwind",
      "Review": "I'm here almost every weekend. It's a great place to chill & unwind. The place is premium & cozy, and their customer lounge.. Yeah, awesome!"
    },
    {
      "User": "tbose",
      "Location": "Kolkata (Calcutta), India",
      "DateofReview": "Reviewed March 31, 2015 ",
      "ReviewTitle": "Premium Mall in Davao City",
      "Review": "The premium mall in the city of Davao.Has a good choice of standalone shops and brands.Food court could have been a little bigger though."
    },
    {
      "User": "WanderLustDavao",
      "Location": "Davao City",
      "DateofReview": "Reviewed March 25, 2015 ",
      "ReviewTitle": "No ordinary mall",
      "Review": "More than a mall, Abreeza is a lifestyle destination. With stores that displays a mix of local and global brands, the mall is interestingly designed that makes strolling along its sprawling spaces a leisurely pursuit. It also has green spaces that gives visitors literally a breath of fresh air. It is also adjacent to a church, condominiums, schools and residential areas."
    },
    {
      "User": "KlausDORING",
      "Location": "Davao City",
      "DateofReview": "Reviewed February 28, 2015 ",
      "ReviewTitle": "Manila and the whole in Davao City",
      "Review": "The moment, you enter the Abreeza Mall, you think you visit Manila. For Davao City, this mall is a great additional accomplishment."
    },
    {
      "User": "Samy N",
      "Location": " ",
      "DateofReview": "Reviewed November 8, 2014 ",
      "ReviewTitle": "High class mall",
      "Review": "Once you enter this mall, you'll feel like you're somewhere at makati malls, it really a good to spend time shopping or eating, watching cinema movie or have a cup of coffe."
    },
    {
      "User": "MarJho16",
      "Location": "General Santos City, General Santos, Philippines",
      "DateofReview": "Reviewed October 6, 2014 ",
      "ReviewTitle": "Ordinary Mall",
      "Review": "We came here just to eat and also stroll but the mall was so ordinary that there is no something in there to look for."
    },
    {
      "User": "raymmiconmapper",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "Bacolod, Philippines",
      "Location": "Bacolod, Philippines",
      "DateofReview": "Reviewed September 20, 2014 ",
      "ReviewTitle": "Davao's new destination",
      "Review": "new place to dine,shop & unwind in Davao city .Abreeza mall like all Ayala malls are trendy & chic.The atrium offers wide area for family & friends & the playground as well.What I like most here is the cleanliness & security of the mall..they have lots of shops of branded products but also affordable & pocket-friendly stores..there's the adjacent Seda Abreeza hotel..come & discover Ayala Malls, \" love the mall\"."
    },
    {
      "User": "chickmom",
      "Location": "Cebu",
      "DateofReview": "Reviewed September 10, 2014 ",
      "ReviewTitle": "Ayala in Davao",
      "Review": "Ayala mall is known for its friendly design and interiors. This was my first visit to Abreeza though I have frequented SM Davao before.\r \r Famous branded stores are here and the usual Ayala design is obvious. Their department store and grocery is Robinsons. The kids like the activity area where they are free to roam and play around while the adults take their pick in the stores nearby. As a member of VIPinoy, I was able to use their lounge for free.\r \r I am looking forward for the a more eco-friendly mall with gardens and trees to cool off which Ayala is known for. So expect an expansion in the coming years."
    },
    {
      "User": "ชินวุฒ อ",
      "Location": "Bangkok, Thailand",
      "DateofReview": "Reviewed September 2, 2014 ",
      "ReviewTitle": "Cool",
      "Review": "Everything that you need is in this place. What I like about the place is they have some Customer Lounge and Free Charging Station (although some of them are defective). Go up and look for that stalls that are selling very affordable fruits. Hmmmm. Yumm!"
    },
    {
      "User": "Liezel G",
      "Location": "Davao del Sur Province, Philippines",
      "DateofReview": "Reviewed August 8, 2014 ",
      "ReviewTitle": "new place for shopping, attractions and family",
      "Review": "This is one of the newest mall. It is one of spots we visit every Sunday right after the sunday mass at Redemptorist church. The atrium has a playground that my son loves so much. This mall offers quite expensive fashion clothes, the mall is big and not crowd-y. What I like most is they have the first branches of restaurants in the city."
    },
    {
      "User": "McJhoe",
      "Location": "Al Ahsa, Saudi Arabia",
      "DateofReview": "Reviewed August 5, 2014 ",
      "ReviewTitle": "Nice place in davao",
      "Review": "Everything is there if you need especially when you are staying at seda hotel a few steps ahead.It houses high end restaurants and cafes,and expensive signature fashions.They have very nice and beautiful landscapes."
    },
    {
      "User": "Melanie R",
      "Location": " ",
      "DateofReview": "Reviewed July 22, 2014 ",
      "ReviewTitle": "Nice place to hang out",
      "Review": "Nice restaurants (with unique interior as well as exterior) to eat with family and friends. There are several brand name clothing stores to shop from."
    },
    {
      "User": "JEmmanuelLasPinas",
      "Location": "Las Pinas",
      "DateofReview": "Reviewed June 21, 2014 ",
      "ReviewTitle": "Newer Mall in a good location",
      "Review": "This is a newer mall in a very accessible location. Lots of name brand stores, good restaurants, supermarket, banks, cafes to choose from. There is also a really nice hotel right next to it."
    },
    {
      "User": "Ecyor",
      "Location": "Manila",
      "DateofReview": "Reviewed May 2, 2014 ",
      "ReviewTitle": "Confusing mall",
      "Review": "I've been to other Ayala Malls, and this one had a quite confusing layout. Nonetheless, it gave a nice contrast in the hangout places in Davao city. It's very accessible and about midway between the airport and town proper.\r \r Shops are quite typical also. Much of the landscape surrounding it are high-end condominiums."
    },
    {
      "User": "profzulueta",
      "Location": "Bacolod, Philippines",
      "DateofReview": "Reviewed April 12, 2014 ",
      "ReviewTitle": "Taking the mini buses from Abreeza Mall to Tagum City.",
      "Review": "We were travelling from Cagayan de Oro to Tagum City, Davao to participate in the 2014 Prisaa National Games. Upon arrival in Davao City, we were told to go to Abreeza Mall where the Davao Metro Shuttle buses going to Tagum have a terminal. \r \r The first taxicab overheated right in front of the main entrance of the mall and the guard helped us load our belongings to another cab to bring us to the Davao Metro Shuttle bus which was located at the back. From Ecoland bus terminal to Abreeza Mall the meter read 130 pesos and we paid an additional 50 pesos in the new cab that brought us around to the back.\r \r We arrived in Abreeza Mall past five pm, after an eight hour trip from Cagayan de Oro so we decided to rest first inside the mall and eat some snacks before proceeding to Tagum.\r \r We were informed by some travellers that the mall was built by Ayala and the anchor store is Robinsons. We bought some food at the Robinsons Supermart which was huge and went malling. Being an Ayala property, the mall was well constructed and modern looking.\r Amenities included escalators and elevators. Airconditioning was more than ample. ATM machines were all ideally located in the different levels. \r \r There were several high end stores and the usual fast food franchises.\r \r After one hour we decided to proceed to the Davao Metro terminal near the Abreeza/\r Robinsons Supermarket entrance but there was no bus around when we arrived and the lines were already long because office workers going home after work were starting to arrive. \r \r After another hour the mini buses started arriving every 15 minutes. To cut the story short we finally arrived at our destination from Abreeza mall at around 9:00 PM.\r \r Travel notes: Take the buses from Ecoland Terminal when going to Tagum from Davao City. Cost and travel time is almost the same. Less transfer hustles especially if you have luggages to carry. Davao Metro and Bachelor Express have clean and safe buses at Ecoland. You will also save on taxi fare."
    },
    {
      "User": "Fl0ng",
      "Location": "Cebu City, Philippines",
      "DateofReview": "Reviewed March 7, 2014 ",
      "ReviewTitle": "Strolling, Eating and Meeting Close Friends at Abreeza",
      "Review": "Before I left Davao Last year, Abreeza was about to open, everyone was so excited. Now, I promised to myself that when I got home, I have to visit Abreeza and you know what, my experience in Abreeza was unforgettable. First, I met my three closed best friends and dancers, coincidentally. Second,oh my, this mall is to the next level, they got a cool escalator, a very expensive elevator, a free charging station everywhere and washrooms are very clean. And lastly, as a consumer, first time in my life that I went to a mall, a guard opened the cab’s door for me, I was speechless, I thought I was in a five star hotel and when I was cleaning my shoes in the washroom, a janitor approached me, As he handed me his cleaning towel, he smiled and said, “kani gamita sir oh.” I was amazed. I can’t hide my reaction, I was really surprised and proud. This is my hometown and they treated me well. They had truly a very satisfying customer service. Well-Trained."
    },
    {
      "User": "Shamrockbuddy",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "Bordentown, New Jersey",
      "Location": "Bordentown, New Jersey",
      "DateofReview": "Reviewed December 29, 2013 ",
      "ReviewTitle": "Like the hustle and bustle ? Shop here.",
      "Review": "Just like any Mall in the US but maybe a little better. One big store and many, many specialty shop all over the place. I liked shopping and just walking through the place. Great service and nice restaurants too. Take a cab, forget about driving. You can change your money at any ATM too."
    },
    {
      "User": "GlobalGoodTimes",
      "Location": "Las Vegas",
      "DateofReview": "Reviewed September 16, 2013 ",
      "ReviewTitle": "Nice new upscale mall!",
      "Review": "Nice modern multi-level mall in the heart of the city. Very easy and ample parking and stores aplenty, many of which you would see in many U.S. malls. It has a nice food court, lots of fast food and dining spots, a very good movie theater, and convenient restroom facilities! Nice addition for the shopping savvy in the city."
    },
    {
      "User": "MijnlieverdFH",
      "Location": "Amsterdam",
      "DateofReview": "Reviewed May 12, 2013 ",
      "ReviewTitle": "Convenient, ride to the next city- right at the doorstep.",
      "Review": "Convenience is one but other goods are too expensive, Signature items are just at its price. but can go around to look for some inexpensive, only one or two shop(s) that can answer the need.\r \r This is also another Davao City's pride like the other big malls in town."
    },
    {
      "User": "lenie",
      "Location": "almere",
      "DateofReview": "Reviewed July 17, 2012 ",
      "ReviewTitle": "excellent shoppingmall",
      "Review": "specialy on those warm philippine day,s this is one of those places to look around, almost every shop is there, and there always extra things organised on the ground floor, like show,s music and a lot more activities, and when you go to the highest floor there is a special foodcourt, and a lot of restaurants in the open air part you can see the planes landing on davao airport, they are even building a new 4 star hotel to the side of it (ayala opening 2013?) furher are there 3 more big shopping malls within 10 minutes driving with a taxi costing around 40/60 pesos"
    },
    {
      "User": "Jeremy N",
      "Location": "Dover, Delaware",
      "DateofReview": "Reviewed July 8, 2012 ",
      "ReviewTitle": "Beautiful Mall...American Prices",
      "Review": "Great place to visit...its a great mall and very modern and has Starbucks and TGI Fridays if you miss those places from the States :) However the prices there are inline with American prices for food and products. The movie theater is really nice and you get to pick your seat even when you get your tickets which I never saw before but the theater prices are WAY cheaper than in the USA so thats a plus! If your in Davao its a great place to stop!"
    },
    {
      "User": "saint28daisy",
      "Location": " ",
      "DateofReview": " ",
      "ReviewTitle": " ",
      "Review": " "
    },
    {
      "User": "Philippines",
      "Location": "Philippines",
      "DateofReview": "Reviewed May 16, 2012 ",
      "ReviewTitle": "Retail therapy at ABREEZA",
      "Review": "The Abreeza Mall is a new and huge mall in Davao City and a one-stop haven for shoppers like me. Built on a 10-hectare land along Bajada, right across the Redemptorist Church, this Mall is a joint venture between Anflocor and Ayala Land Inc. Another beautiful Ayala Mall that reminds me of the TRINOMA in Quezon City.\r \r I immediately bought me a tall cup of classic Starbucks caffe latte to fuel my whole day of retail therapy in Davao City. Abreeza carries elegance with its name; obviously for the high end branded shops that it houses, and the whole modern, sleek physical structure. It was newly inaugurated in 2011 and has attracted Davaoenos from all walks of life. My friends and I ate a delicious lunch at Bigby’s.I observed that there were a number of interesting restaurants in the complex , modern cinemas, a Robinson’s Department Store and Supermarket. Retail therapy to the max!!!"
    },
    {
      "User": "50ftqueen",
      "Location": "Davao City, Philippines",
      "DateofReview": "1 week ago",
      "ReviewTitle": "Best place for South Sea Pearls",
      "Review": "This place is the best place to buy authentic souvenirs from Mindanao. The souvenirs come from almost all tribes in Mindanao, and you can be sure that if you are nice and haggle well enough, you will get a good price for your purchases. Most of the stores here are airconditioned, but wear comfortable clothing that you can easily slip in and out of if you plan to try on clothing.\r \r I go to Aldevinco every chance I get because of their south sea pearls. Some tips:\r \r 1. DO NOT PURCHASE PEARLS FROM THE FIRST STORE YOU VISIT. Take some time to go around to compare prices among the stores as these will vary.\r \r 2. Read up on buying pearl jewelry. Know how to spot fake pearls from real ones, and that freshwater pearls do not have the same lustre as south sea pearls, tend to be smaller and cost less. \r \r 3. Credit cards are accepted at some stores (e.g. for purchases such as pearls), but there is a 3.5-5% additional charge. For small purchases like trinkets etc., it is best to pay in cash.\r \r 4. Be nice. Haggling is an art and your charm and kindness will go far. I've been frequenting a shop for several years and the owner is kind enough to suggest and select better quality pearls for me.\r \r 5. Always remember that you get what you pay for. If you pay less for pearls, expect that you will get pearls that maybe have too many fishbites, have an uneven lustre etc. The good quality pearls have less fishbites, an even color, and are round/even in shape.\r \r 6. If you have access to a jewelry maker, purchase loose pearls instead and have them set in gold. The ready to wear earrings for sale at Aldevinco are glued or mounted on stainless steel. Bigger pearls need a solid post and a large push back to ensure that your earring stays nice and secure when you wear them. \r \r Enjoy shopping!"
    },
    {
      "User": "sabi0james",
      "Location": "Manila, Philippines",
      "DateofReview": "March 7, 2018",
      "ReviewTitle": "A great place to find authentic Davao/Mindanao items",
      "Review": "Imagine a whole complex dedicated to local crafts, that's basically what Aldevinco is. Stall after stall offering local clothing, jewelry, souvenir items. There are also some money changers to help tourists doing some shopping. Located near Ateneo de Davao and Marco Polo hotel, the complex is very accessible. The night market is also located just outside the complex . So day and night this place offers something to visitors and residents as well."
    },
    {
      "User": "pipots",
      "Location": "Imus, Philippines",
      "DateofReview": "January 28, 2018",
      "ReviewTitle": "Must to buy pearls and local goods",
      "Review": "It's my third time at Aldevinco and I still enjoy going. It's a great place to buy pearls which I can use on a daily basis. I love it that most shops have pearl designs that are modern and youthful. I wouldn't say that this place is for everyone but it's nice to visit if you love jewelry and local goods. "
    },
    {
      "User": "redgotsohigh",
      "Location": "Manila, Philippines",
      "DateofReview": "November 26, 2017",
      "ReviewTitle": "Go to place for your shopping needs",
      "Review": "Definitely the place to be if you're looking to buy pasalubong for your loved ones. Items here ranges from shirts,keychains,sarongs,bags and a whole lot more. They even have money changers in case you run out of PHP money."
    },
    {
      "User": "ymalih",
      "Location": "Davao City, Philippines",
      "DateofReview": "November 16, 2017",
      "ReviewTitle": "Fun place",
      "Review": "As one goes in and out of the stores im Aldevimco, you will see various apparel, trinkets furnitures and accessories both home and office"
    },
    {
      "User": "lionlamica",
      "Location": "Florida",
      "DateofReview": "November 9, 2017",
      "ReviewTitle": "Nice friendly shops",
      "Review": "We did some shopping after my wife got out of the dentist office there. Most of the shops are full of souvenirs for the tourist looking for something about Davao, they also have some shops selling more traditional type clothing. This one shop had these wooden carved frogs that if you run this stick that comes with it across it's back it sounds like a frog. Some shops are a little pricey if your from america and some are reasonable you just need to look around or in my case my wife is from Davao so its a little harder to charge me more than the locals and my wife lets them know about that kind of stuff."
    },
    {
      "User": "Chris C",
      "Location": "Manila, Manila, Philippines",
      "DateofReview": "November 5, 2017",
      "ReviewTitle": "Aldevinco Shopping Center",
      "Review": "- visited Nov 2017 - opens around 10am - near Pasalubong Center - mostly souvernir items, clothing items - limited choices, you'll be done in around 30 mins to 1 hour - accessible to public transport"
    },
    {
      "User": "Raf O",
      "Location": "Philippines",
      "DateofReview": "October 19, 2017",
      "ReviewTitle": "Souvenirs. ..",
      "Review": "So many type of souvenirs to choose from...price is good. People are friendly and helpful. Quiet shopping center."
    },
    {
      "User": "pastelprism",
      "Location": "Manila, Philippines",
      "DateofReview": "October 19, 2017",
      "ReviewTitle": "Souvenirs Galore",
      "Review": "This is definitely a go-to place when shopping for souvenirs. Tourist shops tend to be expensive so I was having second thoughts visiting the place, but we went anyway. I was pleased to find that the prices here are low that I was able to get stuff for everyone in the family, even to my officemates. When I got to back to Manila, I found same items being sold about 200% higher than the price at Aldevinco. We got bags, shirts, malongs, pouches and wallets and even pearl earrings that we had to buy additional baggage allowance or we'd exceed as the shopping was unexpected. Just make sure you have enough cash because the shops don't accept credit cards (or at least the ones we've been to)."
    },
    {
      "User": "New Zealand",
      "Location": "New Zealand",
      "DateofReview": "October 15, 2017",
      "ReviewTitle": "Beware of the varying prices from one store to another",
      "Review": "This place has quite a few stores that sell souvenir items from Davao. However, it pays to go around and check the prices as they can vary from one store to another - even if it's for the same item! The layout of the stores aren't really appealing to me as they seem to squash everything they sell in tiny spaces, so there really isn't enough room to move around in. What this shopping mall (if you can really call it that) is famous for is a place to go to if you want to exchange your U.S. dollar at black market rate."
    },
    {
      "User": "Edgar Ian T",
      "Location": "Davao City, Philippines",
      "DateofReview": "September 24, 2017",
      "ReviewTitle": "Best Good Souvenirs in Davao",
      "Review": "You can find these at the heart of Davao City, Beside Marco Polo Hotel. There are many souvenirs they offer specially the Malong. try it!"
    },
    {
      "User": "moshemo19",
      "Location": "Pampanga Province, Philippines",
      "DateofReview": "August 26, 2017",
      "ReviewTitle": "Place to find souvenirs",
      "Review": "If you need to find souvenirs of Davao, this is thr place to go. There's just lots of shops. It being near Roxas Avenue, it is convenient to drop by."
    },
    {
      "User": "lemmorcv",
      "Location": "Las Pinas, Philippines",
      "DateofReview": "August 15, 2017",
      "ReviewTitle": "Very Hot",
      "Review": "There are a lot of street seller selling things that is not useful for you. They are very persistent to a point that you can't concentrate on looking around to choose what to buy. Don't come during day time as the building is so hot...More"
    },
    {
      "User": "Althea-CZ",
      "Location": "Iloilo City, Philippines",
      "DateofReview": "July 18, 2017",
      "ReviewTitle": "Batik Souvenirs",
      "Review": "I usually go to Aldevinco for my \"pasalubong\" shopping. It's a shopping paradise for batik and Southern Philippines culture and tradition. I was a bit scared when I entered because many vendors were offering their foreign currency exchange services. It's somewhat a turn-off for tourists...More"
    },
    {
      "User": "Jonathan Christ... B",
      "Location": "Davao City, Philippines",
      "DateofReview": "April 13, 2017",
      "ReviewTitle": "ANYTHING AND EVERYTHING YOU NEED ABOUT DAVAO",
      "Review": "It is a place to antiques, memorabilias about davao, souvenirs erc.....friend people, right price just infornt of MArco polo davao."
    },
    {
      "User": "BennieGS2016",
      "Location": "Davao City, Philippines",
      "DateofReview": "April 11, 2017",
      "ReviewTitle": "Variety to chose from but...",
      "Review": "Variety to chose different take home goods but the alley is not well suited for shopping style. Thin space for walking and you felt like you are in incubator because the hallway are too small."
    },
    {
      "User": "beachnutts73",
      "Location": "Davao City, Philippines",
      "DateofReview": "March 6, 2017",
      "ReviewTitle": "Cool place to shop souveniers",
      "Review": "Aldevinco is a cluster of similar shops all together in a large shopping center. Great place to find Davao souvenirs and traditional Philippines culture and art. Also, good place to exchange currency as their rates are always better than the banks and malls. Parking is...More"
    },
    {
      "User": "Victorianlad",
      "Location": "Melbourne, Australia",
      "DateofReview": "February 6, 2017",
      "ReviewTitle": "Good foreign exchange rates",
      "Review": "I had been to this large collection of souvenir stalls years ago so this time my focus was on changing Australian dollars. A Filipino - Chinese stallholder provided a very good rate."
    },
    {
      "User": "DonDan16",
      "Location": "Hamburg, Germany",
      "DateofReview": "January 15, 2017",
      "ReviewTitle": "Same Same",
      "Review": "Printed Fabrics of all kinds. Money changers. China things. Clothes. I don't really see a difference between the stores. Nice to see if you are around anyway."
    },
    {
      "User": "Ajie A",
      "Location": " ",
      "DateofReview": "December 10, 2016",
      "ReviewTitle": "Davao Souvenirs",
      "Review": "If you want to bring home pasalubong - then this is the place! You can shop for small items to antique furniture... be sure to canvass first and haggle. It is cheaper if you buy a dozen or half a dozen. Bought scarves and batik...More"
    },
    {
      "User": "yamvillanueva",
      "Location": "Singapore",
      "DateofReview": "November 29, 2016",
      "ReviewTitle": "Pasalubong! ",
      "Review": "A one stop shop for buying goodies to bring home to family & friends. Reasonable prices and can haggle and ask for discount."
    },
    {
      "User": "CheParacuelles",
      "Location": "Davao City, Philippines",
      "DateofReview": "November 10, 2016",
      "ReviewTitle": "looking for Davao and Mindanao souvenirs in a cheap price yet good quality?",
      "Review": "if you travel to Davao and looking for Davao and Mindanao's souvenirs in a cheap price yet good quality, you will never be disappointed in Aldevinco Shopping Center because you can shop as many as you can. you can haggle the price too :)"
    },
    {
      "User": "Christine F",
      "Location": " ",
      "DateofReview": "October 27, 2016",
      "ReviewTitle": "Shopping Spree",
      "Review": "My mom loves to shop and since our hotel was a few blocks away, we always dropped by here during our stay. I bought some stuffs and they love the \"durian\" keychain. I also love the pearl bracelet that i bought for myself. Night market...More"
    },
    {
      "User": "Johnny L",
      "Location": "Davao City",
      "DateofReview": "October 20, 2016",
      "ReviewTitle": "the best",
      "Review": "The quintissential DAVAO shopping place for everything that is PASALUBONG, or the things that you bring to your love ones from a travel. You can find tshirts, jewelries, musical instrument, and even have your foreign currency change."
    },
    {
      "User": "Inday23",
      "Location": "New York City, New York",
      "DateofReview": "October 18, 2016",
      "ReviewTitle": "Excellent shopping place for pearls and native souvenirs",
      "Review": "I love to shop here in Aldevinco, they have good selection of pearls jewelries and the price is good! You can also buy native souvenirs for your love ones."
    },
    {
      "User": "filipin0traveller",
      "Location": "manila",
      "DateofReview": "September 30, 2016",
      "ReviewTitle": "Popular Souvenir Shop",
      "Review": "Many shopping stalls that offer souvenirs.Near Marco Polo Hotel, Ateneo de Davao and the night market. Better haggle before buying."
    },
    {
      "User": "Jon M",
      "Location": " ",
      "DateofReview": "August 26, 2016",
      "ReviewTitle": "Great shopping experience",
      "Review": "From my hotel on Quimbo Street, it was only a P8.00 trip to this shopping center. It was relatively safe at Aldevinco shopping center, it was close to Ateneo de Davao, though lots of street vendors will solicit you, I personally found their persistence impressive,...More"
    },
    {
      "User": "Sol P",
      "Location": "Davao City, Philippines",
      "DateofReview": "August 25, 2016",
      "ReviewTitle": "IT'S A MUST!",
      "Review": "Aldevinco Shopping Center is one of the tourist spot in Davao City. Your visit or vacation is not complete without shopping here, where you can find Davao's novelty items prices very affordable. Enjoy shopping!"
    },
    {
      "User": "musickaren",
      "Location": "Mandaluyong, Philippines",
      "DateofReview": "August 25, 2016",
      "ReviewTitle": "lots of souvenir stores, near roxas street(food strip)",
      "Review": "i just did some window shopping. lots of items(pearls, textiles) are being sold, prices are slighty different from one shop to the other so you better check our all store to find the most affordable items. located along roxas street. so you can eat after...More"
    },
    {
      "User": "Darryl G",
      "Location": " ",
      "DateofReview": "August 25, 2016",
      "ReviewTitle": "Local souvenirs and some",
      "Review": "Place is known for buying local souvenirs, there are some shops that offer foreign exchange. Easily accessible by jeepney."
    },
    {
      "User": "Werner I",
      "Location": "Karlskoga, Orebro Lan, Sweden",
      "DateofReview": "August 18, 2016",
      "ReviewTitle": "Lot of cheap stores",
      "Review": "If you visit Davao I can recommend a visit here. You can find lot of cheap t-shirt and bags to low price. Buy only if you ca see price label at what you want. In some stores they give you a much higher price if you are tourist. It´s also many money changer here, but rate is not same in all so ask in a few for best rate. You can buy pearls from Samal island, but price is a little high. Better buy them at Samal"
    },
    {
      "User": "DiyosaLife",
      "Location": "Davao City, Philippines",
      "DateofReview": "August 1, 2016",
      "ReviewTitle": "Go to Place for Pasalubong",
      "Review": "If you're looking for cheap, authentic Davao souvenirs, this is definitely the place to go to. You may haggle all day long for assorted key chains, shirts, caftans, bags, and other souvenirs items. Plus, if you want to have your foreign currency changed to pesos, there are multiple money changers here."
    },
    {
      "User": "HelenaGuerra",
      "Location": "Washington DC, District of Columbia",
      "DateofReview": "July 30, 2016",
      "ReviewTitle": "Bunch of stores",
      "Review": "Many vendors selling souvenirs. Pearls are a big thing here. Also handicrafts and textiles. Quality varies a lot so search and bargain hard."
    },
    {
      "User": "Hồng Anh N",
      "Location": " ",
      "DateofReview": "July 22, 2016",
      "ReviewTitle": "Amazing paradise shopping center",
      "Review": "A paradise of souvenir and decorations !! You can find many things with the same quality but very low price. There are various kinds of souvenir, they are all interesting and unique! Don't forget the pearl! You should buy some! My tip is dont buy immediately what you see, just have window shopping first and then decide which store has the best ones! Good luck and Have fun!!!!"
    },
    {
      "User": "cherry052101",
      "Location": "Taguig City, Philippines",
      "DateofReview": "June 28, 2016",
      "ReviewTitle": "shopping galore",
      "Review": "the best place to shop for souvenirs and pasalubongs. they offer great choices and discounts depending on the bulk you've bought."
    },
    {
      "User": "Leah E",
      "Location": "Tacloban, Philippines",
      "DateofReview": "June 27, 2016",
      "ReviewTitle": "So Low!!",
      "Review": "You get more than what you pay for. The prices of almost everything is way low than the price of the same items in malls. You get the same comfort they have in malls. Got an item at the mall for 45php and the same item in aldevinco was priced at 15php. Where else will you go? Aldevinco :-)"
    },
    {
      "User": "nprila",
      "Location": " ",
      "DateofReview": "June 19, 2016",
      "ReviewTitle": "Pasalubong!",
      "Review": "If you want to get some pasalubong, visit Aldevinco, it is near Marco Polo and Ateneo de Davao. I got a lot of caftans for the girls. And if you want to get some batiks and pearls, you can get it fro. There too. I woild suggest go around first and compare prices. Some pearls are the same price as of Manila's. Some stores are closed on Sundays as well. "
    },
    {
      "User": "CaliTo69",
      "Location": "Philippines",
      "DateofReview": "June 5, 2016",
      "ReviewTitle": "Haggle...",
      "Review": "the place is famous for souvenirs. and some things you must have here are money to spend, time, patience and talent to HAGGLE. You will need time & patience as there are numerous stalls for you to go in and check on their merchandise. Next is you need to know how to haggle as you can really get a good discount. Pearls are plenty if you love them but price is more expensive than those Badjaos who peddle them along the streets."
    },
    {
      "User": "Jojaze A",
      "Location": " ",
      "DateofReview": "May 29, 2016",
      "ReviewTitle": "Souvenirs of Davao",
      "Review": "After savoring all the beautiful places to visit, dine and do in Davao city, the last stop would be to bring home something. this place offers tons of that, from native items to delightful pearls."
    },
    {
      "User": "Davao City, Philippines",
      "Location": "Davao City, Philippines",
      "DateofReview": "May 23, 2016",
      "ReviewTitle": "My guests always ask to be brought to Aldevinco for Shopping",
      "Review": "I go to Shiela's for Batik dusters, Alibaba pants, tie-dyed shirts, beach cover ups and dresses and pants. Also native woven bags and wallets perfect for pasalubong. As well as tinalak cloth and other woven cloth for table or bed covers. For pearls I go to Sam J's both in Aldevinco just across Marco Polo and Ateneo de Davao University. The advantage is that they give me the best price for being loyal. Maybe you can drop my name and get my discounts too! Best though to ask nearby stores for similar garments to get the best price. \r \r My guests never leave Davao without a trip to Aldevinco! "
    },
    {
      "User": "Bloom_donna",
      "Location": "Davao City, Philippines",
      "DateofReview": "May 17, 2016",
      "ReviewTitle": "Cheap yet very unique \"Pasalubong\"",
      "Review": "I always recommend Aldevinco Sopping Center if you want to buy cheap yet unique pasalubong for your friends and family.They had a lot of stuff like Davao Themed Tshirts which normally cost from 2 for 180, unique bags and wallets,beahc outfits, malong and many more.ALso if you buys wholesale stuffs they will give you instant discounts."
    },
    {
      "User": "Dexter M",
      "Location": "Davao City, Philippines",
      "DateofReview": "May 16, 2016",
      "ReviewTitle": "Bring home with you the memorabilias",
      "Review": "This place is a tourist trap and it has been here for many years and already part of the city's heritage. You can also do your money changing here and buy \"batik\" clothes and native artworks. The place is also at the heart of the city and right next to a busy street's night life of food kiosks and all sorts of knick knacks."
    },
    {
      "User": "Jay S",
      "Location": "Luzon, Philippines",
      "DateofReview": "April 14, 2016",
      "ReviewTitle": "Affordable souvenirs, pasalubong",
      "Review": "Visit this place if you're on a budget for 'pasalubong' or souvenirs. \r \r The shopping center is located along CM Recto Ave, just in front of Marco Polo Hotel in Davao. \r \r You can buy candies, pomelo, shirts, batik or malong, bags, and other Davao products. PhP500 to PhP1,500 can go a long way. \r \r Products here are cheaper than those in the airport."
    },
    {
      "User": "calub m",
      "Location": " ",
      "DateofReview": "February 27, 2016",
      "ReviewTitle": "Cheap Souvenirs and Pasalubong",
      "Review": "From scarf to sarong, to batiks and floral ponchos. \r As cheap as 45 pesos per piece (USD 0.94) of scarf. Pack of 10 pieces. Or assorted colors and styles that you are free to choose.\r 350 pesos (USD 7.30) on ponchos (a clear thin piece of silky garment with a slit in the middle for the head, usually worn as top. Over a swimsuit)\r Other items are less than 500 pesos.. You can bargain especially when you will buy in quantity."
    },
    {
      "User": "Christina L",
      "Location": "Davao City, Philippines",
      "DateofReview": "February 25, 2016",
      "ReviewTitle": "Affordable But A Bit Repetitive",
      "Review": "The place has a lot of collectibles as well as Philippine-made products that you can give as gifts or bring to far-away friends. The only drawback is that sometimes the items being displayed would be repetitive for each store making you feel that somehow there is only a few suppliers for all the shops.\r \r If you're not from Davao, I would recommend you stop by this place."
    },
    {
      "User": "AlbertodelaPaz",
      "Location": "Cavite Province, Philippines",
      "DateofReview": "February 24, 2016",
      "ReviewTitle": "Souvenir haven in davao.",
      "Review": "If you are looking for native clothes those which are worn by our ancestors this is the place you shouldnt miss! They offer a variety of souvenirs from clothes, to accessories! We bought abaka bracelets for 15 each and durian magnets for 100/5pcs. They also have tubao and malong! :) keychain and other pasalubong that you want to buy in davao! :) good thing is that it is near the city so you can save time if you are planning to visit this place."
    },
    {
      "User": "Kris_ianne",
      "Location": " ",
      "DateofReview": "January 22, 2016",
      "ReviewTitle": "Good place to get money exchanged",
      "Review": "The Aldevinco Shopping Center is right across the street from the Marco Polo hotel. It is filled with tiny shops offering batik fabrics, purses, blouses, tee shirts, hats, and jewelry. Be careful about buying pearls -- you can tell from one shop to the next that some are fake, but even the costume jewelry in American dollars is a bargain! Don't be afraid to haggle a little with the sellers....you will be tempted to buy something from everyone, because the people are so sweet. I also noticed the money changers there gave MUCH better rates than the hotel. They will give you a higher rate if you exchange large bills. Everything I bought was of good quality, but be sure to try on EVERY TEE SHIRT because the sizes run very small and will vary (I bought two tee shirts from one shop and both of them were listed the same size...but one was a good size and a half smaller than the other). Once everyone at home saw my purchases they begged for me to bring some home to them, so I have to go back and shop again tomorrow!"
    },
    {
      "User": "PauTheCarabao",
      "Location": "Chiang Rai, Thailand",
      "DateofReview": "December 10, 2015",
      "ReviewTitle": "Thai and Chinese products Galore.",
      "Review": "In the past - meaning before the shopping malls like SM, or Gaisano, Felcris, or NCCC took over retailing in Davao City, Aldevinco was practically the only place where you could buy souvenirs from Davao City. There were ethnic crafts like Mansaka beadwork, T'boli Tinalak, wood carvings, antiques, batik cloth from Zamboanga and many other stuff.\r \r Today, the merchandize has been overrun by Thai and Chinese goods. There are lots of pearls being sold there. What the vendors don't tell you is that those are fresh water pearls from China. I have a problem with this because those vendors lie to you. I do NOT like being LIED to.\r \r It is pretty much the same in other shops - including those malls. Therefore, I see no point in going there if you are only going to see the same things in other places.\r \r Davao needs to come up with more and innovative products. They have not changed the kinds of merchandise being sold here. If you have shopped here 30 years ago, little will have changed if you visited now.\r \r Aldevinco is a street-level shop (no second floor). It is not air-conditioned to going there on a hot-humid day will be a test of physical endurance and mental fortitude."
    },
    {
      "User": "Makati, Philippines",
      "Location": "Davao City, Philippines",
      "DateofReview": "November 26, 2015",
      "ReviewTitle": "Batik's at it's Best",
      "Review": "The Aldevinco Shopping Center has a lot of stores in which they sell Batiks and Pearl products, the area in which it is located is just near from a hotel and city's tourist destination. If you want to buy some known products from Davao, visit The Aldevinco Shopping Center for Gift ideas for your love one's. Happy Shopping :) "
    },
    {
      "User": "Marian B",
      "Location": "Luzon, Philippines",
      "DateofReview": "November 12, 2015",
      "ReviewTitle": "Shopping!!!",
      "Review": "Great place to shop for native Davao's souvenirs like shawls, bags, pearls, shirts, fruits, Durian candies etc."
    },
    {
      "User": "msdawna",
      "Location": " ",
      "DateofReview": "November 4, 2015",
      "ReviewTitle": "Looking for Souvenirs",
      "Review": "This is a great place to find souvenirs for your family and friends, you can find from really cheap handcrafted magnets to a really beatiful southsea pearl."
    },
    {
      "User": "theroyalputri",
      "Location": " ",
      "DateofReview": "October 20, 2015",
      "ReviewTitle": "nice shopping place...",
      "Review": "if you want a lot of davao's souvenir items, this place is certainly a must. from bags to pearl accessories to batik clothes, you will have a wonderful time scouting for them in this center. but if you're planning to go to palawan sometime soon,...More"
    },
    {
      "User": "Felicia C",
      "Location": "Walnut Creek, California",
      "DateofReview": "October 9, 2015",
      "ReviewTitle": "Treasures in corners",
      "Review": "My first time in Davao and this was so convenient across from the Marco Polo Hotel. Great gifts, solid prices and locates some antique metal tobacco boxes tucked away in a shop corner. Definitely stop by when you visit!"
    },
    {
      "User": "jessicasY6091HN",
      "Location": "Metro Manila, Philippines",
      "DateofReview": "September 29, 2015",
      "ReviewTitle": "Aljallilah's Gift Shoppe is the way to go",
      "Review": "Everytime i visit Davao City, i make sure to pass by aldevinco for take home presents for family and friends. it's a great place to buy batik stuff, davao city shirts, pearls and custom jewelry. on one side of the center is the fresh fruit...More"
    },
    {
      "User": "bulakbol76",
      "Location": "Singapore, Singapore",
      "DateofReview": "September 22, 2015",
      "ReviewTitle": "One thing - Bargain!!",
      "Review": "It was nice walking around in Aldevinco to see the many different items being sold. Relatively quiet during the day (it is open between 8am to 7pm) but the shop owners are keen to sell their goods when you are browsing around. Feel free to...More"
    },
    {
      "User": "vince19537",
      "Location": " ",
      "DateofReview": "September 14, 2015",
      "ReviewTitle": "Gifts",
      "Review": "Whenever i go back to Korea Or guests come from Korea I go here to buy some pearl jewelries, T.shirts and more. Good good;)"
    },
    {
      "User": "Loislim",
      "Location": "Cebu City, Philippines",
      "DateofReview": "September 14, 2015",
      "ReviewTitle": "very good for first time visitors",
      "Review": "very good stop for first time visitors to get a flavor of what items are available to purchase as souvenirs and to take back. there are a lot of stores selling batik-style fabrics and apparel, as well as pearls, souvenir t-shirts, and even a few...More"
    },
    {
      "User": "Davao City, Philippines",
      "Location": "Davao del Sur Province, Philippines",
      "DateofReview": "September 9, 2015",
      "ReviewTitle": "Nice tasting Davao Made Dried Mangoes",
      "Review": "I bought some dried mangoes and its very delicious. The brand name is \"Philippine Islands\" which is only available in Jasminas and Algems store located at Aldevinco C.M. Recto Avenue Davao City Philippines. Try this product since it is locally made and with an export...More"
    },
    {
      "User": "Ma Cristina M",
      "Location": "Muntinlupa, Philippines",
      "DateofReview": "August 27, 2015",
      "ReviewTitle": "Great finds at a low price",
      "Review": "A colleague of mine suggested where I can buy non-food pasalubong at Davao and said to head to Aldevinco Shopping Center. I got to buy pasalubong for the whole family and for the office as well. I even got huge discount hehe! I got to practice my haggling skills ^_^. Shop at Esnaira's House of Batik if you want good quality products and huge discounts when you buy many items. "
    },
    {
      "User": "Mitch A",
      "Location": " ",
      "DateofReview": "August 18, 2015",
      "ReviewTitle": "Got some pesos?",
      "Review": "It's a shoppin center but in reality it thrives because of its money changer business. Has good reputation in changing different currencies because of good deals and rates and pretty honest people."
    },
    {
      "User": "Jacqui C",
      "Location": "Davao City, Philippines",
      "DateofReview": "August 13, 2015",
      "ReviewTitle": "Honest and Polite Vendors",
      "Review": "I use to buy \"malong\" there. I love how the vendors treat the customers. They are very polite and honest. Truly something to be proud of."
    },
    {
      "User": "Go_Bag_Lite",
      "Location": " ",
      "DateofReview": "August 11, 2015",
      "ReviewTitle": "Very Affordable!!! ",
      "Review": "Price ranges from 35-200! if you're looking for souvenirs with good quality but cheap, go here 👍 lots of shops to choose from!"
    },
    {
      "User": "Richthof R",
      "Location": " ",
      "DateofReview": "August 7, 2015",
      "ReviewTitle": "Shopping",
      "Review": "Great place where to shop souvenirs.... Low price souvenirs and you can buy a wholesale.... I will be back to this place."
    },
    {
      "User": "danalelojo",
      "Location": " ",
      "DateofReview": "July 27, 2015",
      "ReviewTitle": "Great place to buy handmade bags",
      "Review": "Go here if you want to buy: Sarong Bags Earing Necklace Antiques Pouches Thirty Skirts Shorts Pajamas"
    },
    {
      "User": "obieoneobie_1",
      "Location": "Davao City, Philippines",
      "DateofReview": "July 26, 2015",
      "ReviewTitle": "Davao's Indigenous Clothing",
      "Review": "A place where Davao's very own culture is showcased in a form of accessories, clothing, fabric and etc. for which all are based on the works of the Mindanao's indigenous community. This place is best for tourist who opt to experience Davao in one place. Stores also offer money changers accessible to visiting tourists. Located fronting Marco Polo Hotel."
    },
    {
      "User": "6452",
      "Location": "Makati, Philippines",
      "DateofReview": "July 15, 2015",
      "ReviewTitle": "Pasalubong Varieties",
      "Review": "To think about this place, this must be the most iconic place where to buy good stuffs / pasalubong for your friends and families. \r \r We had a chance to go here and purchased some of the items we love. \r \r Definitely a must to go when you visit Davao City. :)"
    },
    {
      "User": "Davao City, Philippines",
      "Location": "Davao City, Philippines",
      "DateofReview": "July 1, 2015",
      "ReviewTitle": "I always change my $$ ers here ....The banks don't give you a fare exchange!! It's also my first to get gifts for friend",
      "Review": "Aldevinco is a great place to get quality suviniers, and a great place to exchange your foreign money's. Highly recommend Singapore Exchange, it's location is on the back side of this strip mall. Josphine's clothing shop is also a great place for fare prices and some American sizes. I've been going here since 20006!!"
    },
    {
      "User": "ANNann00",
      "Location": "Philippines",
      "DateofReview": "June 21, 2015",
      "ReviewTitle": "Shopping haven",
      "Review": "So many things to buy, so little time. If you're looking for pasalubong, aldevinco has a lot! From keychains to tshirts, shawls to jewellery, they have it! When we were in Davao, we went here twice and can't seem to stop shopping, items are very affordable!"
    },
    {
      "User": "KIKO597",
      "Location": " ",
      "DateofReview": "June 15, 2015",
      "ReviewTitle": "More of malongs/RTW clothing than food souvenirs",
      "Review": "We were expecting to buy all our pasalubong (treats to bring home) from here. However, we found that the stores here sell mostly ethnic fabrics (malongs/wrap arounds), t-shirts, blouses, souvenir wallets, and other indigenous items. Yes, there were also food souvenirs of durian/mangosteen candies, but the choices were very limited. The biggest malongs could be bought for as low as 350 pesos. Make sure to haggle!"
    },
    {
      "User": "Roseann G",
      "Location": "toronto",
      "DateofReview": "May 13, 2015",
      "ReviewTitle": "close and convenient",
      "Review": "you have to really know how to bargain. check out the prices first and ask some locals what the reasonable price shd be. also, BE CAREFUL.... pickpocketers loom around. beware of those who are around you."
    },
    {
      "User": "MsManang",
      "Location": "Manila, Philippines",
      "DateofReview": "April 1, 2015",
      "ReviewTitle": "Already an Institution",
      "Review": "My first experience going to this place was 20 years ago for several times when I'm still working with a company that had business in Davao. Now, every time we visited Davao, it's always a part of our itinerary. \r The stalls are well maintained, and we purchased souvenir t-shirts, dresses, malongs, native woven fabrics for bedsheet and bags. There are also pearls but is much cheaper in Palawan. There are also some wood souvenirs, other accessories, and hard to find objects. .\r Even with the proliferation of malls in Davao, business it seems is still good because of the support of management to maintain it's facilities, competitive pricing / variety of goods, the sopport of locals who told us that it's still the \"in place\" in shopping, and lastly it seems that we're just in \"Greenhills Shopping Center\" together with the muslims.."
    },
    {
      "User": "cjcjcj89",
      "Location": "Calamba, Laguna, Philippines",
      "DateofReview": "March 19, 2015",
      "ReviewTitle": "Pearls, Malong, Bags ",
      "Review": "If you need to buy pasalubong like pearls,tshirts, foldable bags and fans, malongs, dresses, etc., Aldevinco is the best place to visit. Just be persuasive in haggling. There are lots of shops to visit. If you want food for pasalubongs like durian, marang, mangosteen etc, visit bangkerohan market. "
    },
    {
      "User": "Chrnzke",
      "Location": "Houston, Texas",
      "DateofReview": "February 4, 2015",
      "ReviewTitle": "across the street from the hotel shopping",
      "Review": "the shops are small but has lots of selection; be careful with your purses/wallets but otherwise they are helpful and can carry your stuff to the hotel for small tip"
    },
    {
      "User": "raymmiconmapper",
      "Location": "Quezon City, Quezon City, Philippines",
      "DateofReview": "January 19, 2015",
      "ReviewTitle": "Aldevinco experience",
      "Review": "This pasalubong center is composed of mini boutiques that sells genuine pearl accessories in not so expensive prices, gong-like necklace and earrings, unique accessories, set of jewelry, clothes such as tshirt and dress, ethnic bags, muslim headdress, wallets, keychains, fan, hat, sleepers, scarf, sarong, malong and variety of crafts. This place offers a wide range of pasalubong items that's why you must reserve a lot of time if you want to explore every stall.\r \r I have visited Aldevinco 2x (2010 and 2014.) I remember that this is a shopping place that was recommended by one of our tour guide during our on-board training."
    },
    {
      "User": "Tee T",
      "Location": "Makati",
      "DateofReview": "December 2, 2014",
      "ReviewTitle": "Pasalubong center",
      "Review": "Place to go if you want to buy pasalubong (excluding foods) from Davao. White shirts cost us P100/pc. Colored shirts cost P150/pc. Ref magnet P35/pc."
    },
    {
      "User": "Anne S",
      "Location": "Pasig, Philippines",
      "DateofReview": "March 23, 2014",
      "ReviewTitle": "One-stop pasalubong shops",
      "Review": "Located right infront of Ateneo de Davao, Aldevinco Shopping Center has all the pasalubong items you need. I bought keychains at just P10 each and nice, expensive-looking scarfs at P40 each. You just have to tell them how much your budget is and they will show you which of their items can be bought at that price."
    },
    {
      "User": "Jie-E",
      "Location": "Alice Springs, Australia",
      "DateofReview": "October 24, 2013",
      "ReviewTitle": "Best Money Changer",
      "Review": "If you want to have the best money changer in Davao, go to Aldevinco and look for \"Singapore\" money changer and see Aida Yuson. Very honest and a lovely lady - always the best rate!!!!"
    },
    {
      "User": "Riza O",
      "Location": "Manila, Philippines",
      "DateofReview": "August 18, 2013",
      "ReviewTitle": "Shop until you develop leg cramps or run out of pocket money",
      "Review": "We stayed at the ALU Hotel Davao at the Central district of this metropolis. Aldevinco shopping center is just three blocks away from our hotel at the corner of Claveria Street and Roxas Boulevard a triangular area with more than a hundred stores.\r \r This shopping center carries a wide variety of merchandise ranging from souvenir items, leather and weaved bags, clothing items or materials, scarf, shirts and T-shirts to carved or plain chest box (baul) to fresh or south-sea pearls.\r \r If you are tagged as a \"tourist\" expect to be quoted 3-4x the regular selling price. This is the place to hone in ones \"haggling\" skills. Interestingly, there are more items that appeals to women shoppers. So if you are accompanying your \"significant partner\", be prepared for a long wait.\r \r Inside the center is Dreambuck coffee shop, an air-conditioned facility where you can \"cool your heels\", read a magazine or order coffee or a light snack while waiting. (Sorry no Wi-Fi). Later carrying shopping bags will be a good exercise for your biceps at anytime of day."
    },
    {
      "User": "MrEdnWilbur",
      "Location": "Luzon, Philippines",
      "DateofReview": "June 10, 2013",
      "ReviewTitle": "The place for \"pasalubong\" shopping.",
      "Review": "I like Aldevinco because the batik, bags, pearls, etc. are cheaper there. Because it's a cluster of stores, the place will give shoppers a wide selection of Davao souvenir items like shirts, fridge magnets, coin purses, etc. Don't leave Davao without checking this place out."
    },
    {
      "User": "MijnlieverdFH",
      "Location": "Manila, Philippines",
      "DateofReview": "May 5, 2013",
      "ReviewTitle": "One-stop \"Pasalubong\" Place",
      "Review": "This was probably my third time at Aldevinco. The last time was a number of years ago. I'm not sure but there seem to be more options of stuff one can buy this time. But I was a bit sad to have not been able to find the native jewelry store I once went to. \r The most common items found here are pearls (and pearl jewelry), souvenir shirts, batik, malong, ethnic crafts, souvenir trinkets like magnets and keychains, and other local items ideal for \"pasalubong.\"\r The price is pretty okay considering these are souvenir items. But you might want to haggle first before purchasing something because the first price store salespeople give is usually much higher than the \"real\" or \"lowest\" possible retail price for the item.\r It is also conveniently located near other establishments. There is a market right beside it. You can buy there fruits, candies and other delicacies."
    },
    {
      "User": "totorohead",
      "Location": "Jacksonville, Florida",
      "DateofReview": "January 29, 2013",
      "ReviewTitle": "A Shoppers Paradise",
      "Review": "You name it, you can get everything in this place. Hold on, check that. What I meant to say is you can get batik cloths, jewelry made of pearls and gemstones, copper ware, various types of wood work, ancient swords, shields and other handicrafts. The prices are higher than expected but cheaper compared to the traveler's home country. You are. however, expected to barter and this system could be fun for others while a pain for some :) Additionally, if you run out of the local currency, they have a few money exchangers who offer better rates than banks. In closing, all I have to say is to enjoy and have fun!"
    },
    {
      "User": "saint28daisy",
      "Location": "Amsterdam",
      "DateofReview": "December 6, 2012",
      "ReviewTitle": "Souvenirs? You can find it all here.",
      "Review": "Many stores inside the center. You name it from shirts made out of Batik, necklaces, antiques, woven cloth, bags, other gift items and many more. Also to include money changers and snack bar and restaurant within.\r \r You get in there and come back without buying something is impossible."
    },
    {
      "User": "mzzyap8",
      "Location": "Quezon City, Philippines",
      "DateofReview": "October 27, 2012",
      "ReviewTitle": "Pearls! And batik! And pearls!",
      "Review": "I stayed in Davao for only a couple of days before heading to General Santos with my family, but we made time to stop by Aldevinco for souvenirs. \r \r Aldevinco reminded me of Greenhills and Quiapo, but a quieter, cleaner, and cooler version of the two. Salespeople also aren't as annoyingly persistent as the ones in Manila. Moving on, if you need pasalubong of the non-edible kind, drop by Aldevinco. It's near Ateneo de Davao; along Claro M. Recto Street if I'm not mistaken. \r \r You can get all sorts of stuff here: Aladdin pants from Thailand (we call them \"Prince of Persia pants\"), long printed skirts from India and elsewhere, and stuff native to Mindanao. Prices go from cheap to steep, depending on the material and quality of construction. I got a real batik skirt for Php 800, while my sister-in-law got some Aladdin pants for 1.2k a pop. \r \r I was immediately drawn to one of the many stores selling cultured and natural pearls. My mom is crazy about pearls so I got her a necklace and bracelet set. What would ordinarily go for 1000 or more at SM, I got for 400 pesos (with a little bit of haggling hehe). Apart from pearls, you can also get accessories made from semi-precious stones and polished orange \"coral\" at prices that won't have you clutching at your chest in shock. \r \r Aside from clothes, you can also buy furniture, dried fruit, and bits and bobs to decorate your home with. \r \r After shopping, stop for a durian shake (if you can take the smell) at the restaraunt located in the middle of Aldevinco (forgot the name). This resto is halal, so nom away at the affordably-priced items on their menu: burgers, cake, etc. (Note: the durian shake is actually kind of nice.)\r \r If you like pomelo and can deal with paying 500 pesos for two pieces of fruit, there are pomelo vendors just outside Aldevinco. \r \r Tips:\r \r This place is very wheelchair-friendly.\r \r Even at noon, the place is nice and cool. \r \r If you don't want to buy anything, don't make eye contact!\r \r There's ample parking available."
    },
    {
      "User": "Philippines",
      "Location": "Philippines",
      "DateofReview": "May 16, 2012",
      "ReviewTitle": "Colorful Aldevinco",
      "Review": "The ALDEVINCO Shopping Center is a famous landmark in Davao City, located in a big commercial complex at the junction of Claro M. Recto Avenue and Manuel Roxas Boulevard. In my youth, we called it “ALDEVINCO” and it was our hang-out after school (nearby is the Ateneo U).\r \r After 46 years, ALDEVINCO still is a premiere shopping destination in Downtown, Davao City; where locals, balikbayans, and foreigners shop for “ pasalubongs” (souvenirs) to take home.\r It proudly showcases Mindanao’s heritage and culture, through its antiques and indigenous handicrafts. There are numerous colorful souvenir items that will keep your eyes and mind entertained. I especially love the Batik products (clothes & accessories), and the native Maranao and T’boli handicrafts and jewelries. Of course, the ubiquitous\r “made in China” wares are around….and a handful of Southeast Asian products as well. Note please that all these products are negotiable, especially when buying wholesale. It pays to speak the dialect (Bisayan, Tagalog) but the Filipinos are adept in English, so foreign tourists will not have a difficult time haggling for a good price\r You can also buy fresh fruits and the famous sweet Davao “suha” or pomelos and the exotic looking durian, marang, mangosteen, and rambutan. HAPPY SHOPPING AT ALDEVINCO!!"
    },
    {
      "User": "redhotchili09",
      "Location": "Manila",
      "DateofReview": "November 30, 2011",
      "ReviewTitle": "Davao souvenirs",
      "Review": "What I like about this place is that a lot of its products are local [though not necessarily from just Davao but Mindanao in general]. I love getting my sarongs for use at the beach there. I like the designs because they are unique. Some stalls also sell traditional cloths and clothing although a lot of them already come from neighboring countries such as Indonesia [since Indonesian clothing and those of Muslim Mindanao have similarities]. \r \r They also have small boxes which can be used as jewelry boxes that are inlaid with mother of pearls though these are not from Davao but from neighboring Muslim provinces in Mindanao. \r \r What I don't like about this place, however, is that Indonesian products are often passed off as local ones so you have to be careful about this. \r \r Aldevinco is very accessible and is near Ateneo de Davao and Marco Polo Hotel."
    },
    {
      "User": "Patrice J",
      "Location": " ",
      "DateofReview": "3 weeks ago",
      "ReviewTitle": "Just visit once",
      "Review": "The weather is nice, it never gets hot. They have a mini cafeteria where you can eat snack but basically all you see is a \"farm\" of lettuce and other crops. Its something you can visit ONLY once and take a look around, 5ake a few photos for about 15 minutes. But a cheaper price to buy lettuce."
    },
    {
      "User": "jaquinne",
      "Location": "Davao City",
      "DateofReview": "March 5, 2018",
      "ReviewTitle": "COOL PLACE",
      "Review": "The place is quiet far but very nice. The entrance fee is consumable. Wear rubber shoes or sneakers. For those who want to see strawberry plantation, this is the place to go if you can't go to Baguio City."
    },
    {
      "User": "MijnlieverdFH",
      "Location": "Amsterdam",
      "DateofReview": "March 4, 2018",
      "ReviewTitle": "Great Farmland and refreshing cooler atmosphere in here",
      "Review": "The talk of the town farm located nearly outside the boundary of Davao City. Beautiful farm field with a lot of fresh vegetables for sale. \r \r While there, a refreshing coolness and mountain freshness is felt. We went there middle of the previous year with the group on a short trip passing this farm field. We bought vegetables and fruits from their store."
    },
    {
      "User": "Valdis A",
      "Location": "Kremenchuk, Ukraine",
      "DateofReview": "January 4, 2018",
      "ReviewTitle": "They started to charge entry fee",
      "Review": "Been here few times and the same nice view and ...nothing else.\r Not to go just there purposely if from Davao.\r Just on the way back from Buda, Viewpoint or just from the road trip out of the city.\r But I was surprised to see that they started to charge entry fee like 250 peso per person... if you 4 in the car, so it's comes like 1K! What about tourist buses? For what guys? Just to see how good you are? Or business not good anymore so need to have at least something? Before lots of people come to the shop to buy jam or vegetables, but for now just pay to enter - straight from the road.\r So... good for one time, but nothing else."
    },
    {
      "User": "Amy A",
      "Location": "Ithaca, New York",
      "DateofReview": "January 2, 2018",
      "ReviewTitle": "Pleasant area with fresh vegetables",
      "Review": "Nice stop during our trip in Highland Davao, we liked the freshly harvested lettuce we bought. There is a small restaurant and a good view of the farm with the plots and growing area,"
    },
    {
      "User": "Fay Fay Y",
      "Location": "Los Angeles, California",
      "DateofReview": "November 12, 2017",
      "ReviewTitle": "Good day-trip outside Davao",
      "Review": "This is a worthwhile destination outside of Davao City. You would definitely need to set aside a good part of the day for this trip due to the length of the drive. There is not much to do at the farm but the view to the farm and views at the farm are solid."
    },
    {
      "User": "MSCRob",
      "Location": "Lipa City, Philippines",
      "DateofReview": "September 23, 2017",
      "ReviewTitle": "Strawberries up close",
      "Review": "It was a great stop over travelling from Davao to Bukidnon..A bit difficult to locate the farm, no signage along the national highway..It was a good strawberry picking experience for a certain amount for the fruits harvested, no entrance fee and one can just stop over and take unlimited photos..such a refreshing area with strawberries, ornamentals, lettuce and a variety of herbs and spices. They also sell strawberry jam. Tourists travelling from Davao to CDO should include this farm in their itinerary!"
    },
    {
      "User": "CheParacuelles",
      "Location": "Davao City, Philippines",
      "DateofReview": "July 26, 2017",
      "ReviewTitle": "A place to relax away from the city",
      "Review": "Gong there, you need to bring a car because the place is not just along the road. A nice place to relax, with a cold ambiance and of course you can buy fresh organic lettuce, and if you are luck you pick strawberries too. You don't need to go to Baguio or Benguet for strawberries because we have that in Davao. But"
    },
    {
      "User": "Milany A",
      "Location": "Davao City, Philippines",
      "DateofReview": "July 15, 2017",
      "ReviewTitle": "A W E S O M E !",
      "Review": "Worth every visit, worth the long drive from Davao City, their veggies and fruits worth every penny. I love their lettuce - so fresh and crisp! Too bad it was not the peak season of their Strawberries when we went there - but we're definitely going back! :-)"
    },
    {
      "User": "zylle p",
      "Location": " ",
      "DateofReview": "April 18, 2017",
      "ReviewTitle": "nice weather with a nice view",
      "Review": "We arrive at bemwa farm at around 4:30pm, it was already getting cold. We were welcomed by a red flower (i don't know what kind of flower) but it was very nice. We went to their store to try their strawberry taho but it was already sold out. We just bought their strawberry jam and some of our companions bought some fresh lettuce. The strawberries were not available during our visit. But still. it was a nice place to visit."
    },
    {
      "User": "Aimee T",
      "Location": " ",
      "DateofReview": "April 7, 2017",
      "ReviewTitle": "worth visiting",
      "Review": "worth visiting this place ,❤️ we spent our post christmas party @ Bemwa farm , they also have native roasted pig (for special order basis only)"
    },
    {
      "User": "jedainz",
      "Location": "Davao City, Philippines",
      "DateofReview": "April 6, 2017",
      "ReviewTitle": "be early if you want fresh strawberries!",
      "Review": "There's not an activity you can do here really. It's a farm which supplies vegetables and berries in the city. You can just see the strawberry field and that's about it apart from you can buy strawberries (if you are early enough), jams and vegetables....More"
    },
    {
      "User": "rey m",
      "Location": "Davao City, Philippines",
      "DateofReview": "September 16, 2016",
      "ReviewTitle": "Lovin' the weather",
      "Review": "The place is amazing. Amazing view, cold weather, friendly staff. Cheap veggies (for salad) but the strawberries are still quite pricey."
    },
    {
      "User": "David B",
      "Location": " ",
      "DateofReview": "September 14, 2016",
      "ReviewTitle": "Beautiful and serene simplistic day retreat",
      "Review": "A very simple and Spartan receiving area greets you upon arriving. In between preparing lettuce heads for delivery, the staff will gladly assist you in the most basic of needs and to point you in the right direction. The most important thing is to always...More"
    },
    {
      "User": "Nina C",
      "Location": "Davao City, Davao City, Philippines",
      "DateofReview": "September 6, 2016",
      "ReviewTitle": "something refreshing!!",
      "Review": "i love going to this place!! the cool winds blow and you see green all around you! you may want ro buy fresh produce like lettuce and strawberries. want to pick the strawberries yourself? you will have to come really early because they pick at...More"
    },
    {
      "User": "Lita H",
      "Location": "Manchester, United Kingdom",
      "DateofReview": "August 11, 2016",
      "ReviewTitle": "Impressive Panoramic View",
      "Review": "A lovely place to visit if you fancy looking at rows of vegetables and flowers that seems never-ending. You can buy these fresh from the farm shop at reasonable prices, too, if you arrive early."
    },
    {
      "User": "Davao City, Philippines",
      "Location": "Davao City, Philippines",
      "DateofReview": "June 28, 2016",
      "ReviewTitle": "Nice farm visit, but nothing to buy.",
      "Review": "From Bukidnon on the way back to Davao, family made a turn to BEMWA FARMS. It was a long 15 minutes drive from the highway to the farm store. Nice farm views of vegetation and piped irrigation, but when we reached the farm store, there...More"
    },
    {
      "User": "pancit_canton",
      "Location": "Cavite Province, Philippines",
      "DateofReview": "October 9, 2017",
      "ReviewTitle": "Skip this",
      "Review": "I dunno with you but i think you're just wasting your time coming here.. you'll have to pay for a guide and go inside, my parents said it doesn't look safe.. well it was raining at that time."
    },
    {
      "User": "jan j",
      "Location": "makati city",
      "DateofReview": "February 14, 2017",
      "ReviewTitle": "Not worth your time and money",
      "Review": "Not worth your time and money. There's practically nothing to see here except the landmark outside the cave."
    },
    {
      "User": "Victorianlad",
      "Location": "Melbourne, Australia",
      "DateofReview": "February 3, 2017",
      "ReviewTitle": "Underwhelming",
      "Review": "I do not have a huge interest in WW11 history so this hideout for the Japanese was not overly interesting. There is a small number of displays in the lit cave. Admission is 50 pesos. A housing estate is being developed just beneath the cave...More"
    },
    {
      "User": "Unica Hija V",
      "Location": "Makilala, North Cotabato, Philippines",
      "DateofReview": "November 3, 2016",
      "ReviewTitle": "Japanese Cave House, I'm coming back",
      "Review": "I have been to JCH in 2013 to hang out with co-workers turned friends. We had many meaningful experiences at Samal. Most of our adventures were unplanned, but the caretaker of JCV was the one who gave us directions on what to do while in...More"
    },
    {
      "User": "Steve J",
      "Location": "Norwich, United Kingdom",
      "DateofReview": "5 days ago",
      "ReviewTitle": "If your in pearl farm this is a must",
      "Review": "This was a great little tour the clams are amazing and beautiful clear snorkelling The guide took loads of great photos which we will cherish for life"
    },
    {
      "User": "naidenaelle",
      "Location": " ",
      "DateofReview": "2 weeks ago",
      "ReviewTitle": "Mesmerizing Clamps",
      "Review": "It was my very first time doing this kind of adventure and it was fun. Its not too deep and you can barely touch the clamps, though its not literally that you can touch them but you can come closer to really see it by...More"
    },
    {
      "User": "Gerard L",
      "Location": " ",
      "DateofReview": "4 weeks ago",
      "ReviewTitle": "Taclobo!!!",
      "Review": "Visited the giant clam sanctuary on the recommendation of a college friend who happens to have a farm in Samal Island, and who had some staff working at Pearl Farm, where I was billeted. The Taclobo tour was just a few minutes away by boat...More"
    },
    {
      "User": "Karen N",
      "Location": " ",
      "DateofReview": "4 weeks ago",
      "ReviewTitle": "Snorkel your way",
      "Review": "If you don't have gears for snorkeling before going here as well as action camera, they have it here for rent. If you don't know how to swim, there are guides with floaters you can hold on to. It's quite scary at first but relaxing...More"
    },
    {
      "User": "Maggie Y",
      "Location": "Gennadi, Greece",
      "DateofReview": "February 13, 2018",
      "ReviewTitle": "Spectacular",
      "Review": "Seeing the giant clams and the coral beds was a great experience. The guide is experienced and guides you around the reef."
    },
    {
      "User": "Ricky P",
      "Location": " ",
      "DateofReview": "October 9, 2017",
      "ReviewTitle": "Fascinating and colorful",
      "Review": "At first I was hesitant of pushing through this activity because I thought it was boring. But boom! When I started snorkeling, I got excited with everything that I see! Hundreds of giant clams in different colors and sizes plus a lot of colorful fishes....More"
    },
    {
      "User": "jonalber2",
      "Location": "Singapore, Singapore",
      "DateofReview": "September 5, 2017",
      "ReviewTitle": "A Must",
      "Review": "Try to visit during low tide so you are closer to the clams. This sanctuary has THE MOST colorful and gigantic clams I've ever seen! And thousands of them! Your car/tricycle/habal habal will take you to the dock. From the dock, you have to take...More"
    },
    {
      "User": "John Patrick M",
      "Location": " ",
      "DateofReview": "August 9, 2017",
      "ReviewTitle": "Definitely a must, if you're visiting Samal island",
      "Review": "We had a great time here, the guides were very accommodating. They even lent their personal memory card for the underwater cam that we rented and they just sent the captured pictures to our mobile phone. Will be definitely back in the future!"
    },
    {
      "User": "streeteasy55",
      "Location": "New York City, New York",
      "DateofReview": "August 7, 2017",
      "ReviewTitle": "great swim",
      "Review": "huge, giant clams anyone? heck, this is the place. Great experience snorkeling around and observing giant under water. must to do if you are in samal island. highly recommended"
    },
    {
      "User": "Meinard V",
      "Location": "Singapore, Singapore",
      "DateofReview": "August 1, 2017",
      "ReviewTitle": "A side trip from Samal Day tour ",
      "Review": "It was recommended by a family friend who is from Samal. It didn't disappoint. It's great they do briefing first before taking you to the area."
    },
    {
      "User": "Januspaggers",
      "Location": " ",
      "DateofReview": "July 15, 2017",
      "ReviewTitle": "HIGHLIGHT OF SAMAL ISLAND",
      "Review": "Love love love the Giant Clam Sanctuary. I've never seen Giant Clams up close so we thought it would be a new adventure. It did not disappoint. We didn't book a tour ahead of time and being low season (right after summer), there weren't a lot of boats that'll bring you across to the floating sanctuary. There was a small boat that offered 1,000, but we had a mini snack with local noodles and the locals said we only had to pay 500. Good thing the boat driver agreed, and we were on our way. The entrance fee was I think 100 pesos and you can rent a snorkel, rash guard and GoPro for a fee. We had all our equipment, but rented out a GoPro. I suggest you bring your own SD card since they don't have one available. \r \r Absolutely had the time of my life. Would definitely go back, plus they gave you an orientation of the cause. So far there are 2,000+ Giant Clams in the sanctuary "
    },
    {
      "User": "Ronna V",
      "Location": " ",
      "DateofReview": "July 12, 2017",
      "ReviewTitle": "Worth the travel. Amazing giant clams",
      "Review": "7 kilometers to be exact right from the hagimit falls\r You will find this amazing giant clam sanctuary. \r Going to the sanctuary u need to hire for a bangka to bring u .. Cost 500 pesos good for 4-6 pax ( quite expensive for solo traveler like me. \r And additional 100 for the entrance fee \r 100 if u wanna rent snorkle mask - its a must \r 300 if u want to rent go pro.. \r \r It was like 3 -5 mins boating to get to the sanctuary its located just near to the famous pearl farm. Resort. \r \r The people incharge there welcomed me and they told me theres 5mins lecture.. \r \r After that we proceed to the snorkling site with lifevest and 2 interns assisting for the 1 hr tour. \r \r The water s warm..and when i saw the underwater i was like... Omg this is it. Amazimg. The giant clams were really amazing , plus diff species of fishes, sponges, corals. Sea anemones.. Its amazing. All i can just say say while looking around is wow.. \r Going to the deep part you will see bigger clams as in omg bigger than me for sure.. \r I really enjoyed this experience its really worth it.. And i would definetely comeback with my son..he will love the place am sure.. \r Worth the travel. Worth the money . \r \r - ive been bitten 3 times w those meduim sized fishes.. While i was trying to take picture near the giant clam..they said they are protecting their environment.. I disturbed lol.im sorry..."
    },
    {
      "User": "jonsapon121",
      "Location": " ",
      "DateofReview": "June 8, 2017",
      "ReviewTitle": "First time ",
      "Review": "Amazing to do. Definitely gonna do this again. Very safe. Need a better underwater cam next Time. People selling real mother pearls for good prices, just barter with them"
    },
    {
      "User": "Rravrav",
      "Location": "Manila, Philippines",
      "DateofReview": "May 1, 2017",
      "ReviewTitle": "Must See in Samal",
      "Review": "The best part of our Samal Tour! It's so amazing to see life in those big clam shells.. . Seeing them upclose with wonderful colors of violet orange and a lot more!! \r \r Besides the clams, there were corals and anemones, so you'll find fishes, schools of small fishes and starfishes while snorkeling.. .\r \r Entrance/environmental fee is P100, you can also rent snorkeling gear for P100 and GoPro action camera for 300.. .\r \r Please dont forget to give some tip to your guide.. its a way of supporting our tourism industry."
    },
    {
      "User": "hijaviajeraph",
      "Location": "Quezon City, Philippines",
      "DateofReview": "April 27, 2017",
      "ReviewTitle": "Meet and Greet Taclobo",
      "Review": "It is very unusual for me as a manila girl to see those huge clams here at Samal Island. As part of the itineraries in doing your Samal Island Hopping, you will a chance to see and swim with the clams and other creatures like uncommon fish breeds and of course my favorite star fishes are around the sanctuary.\r \r You have to pay Php100 as environmental fee for reservation and protection of the sanctuary.\r I can give you my friends contact number, he is a local tour guide/boatman here at Samal. He could help you to experience this adventure ^_^"
    },
    {
      "User": "travellerheartAU",
      "Location": " ",
      "DateofReview": "March 1, 2017",
      "ReviewTitle": "Great chance to see the Giant Clams",
      "Review": "Great chance for everyone to see the Giant Clams. Even an inexperienced snorkeller can come along, since the water is so calm\r \r The Taklobo Sanctuary is committed to the protection of the Giant Clams, and helps to educate people on why we don't want to kill these lovely beings"
    },
    {
      "User": "Jennelyn T",
      "Location": "San Jose del Monte, Philippines",
      "DateofReview": "February 20, 2017",
      "ReviewTitle": "Amazing!",
      "Review": "This is the first time I had the chance to have a close encounter with some of the (soon-to-be) endangered species. Thank you for protecting this sanctuary.They even have a professional diver that accompanies people, and even takes pictures and videos underwater. So even if you're a beginner or a pro diver, this should be included in your bucket list."
    },
    {
      "User": "lberezovski",
      "Location": "Sydney, Australia",
      "DateofReview": "February 11, 2017",
      "ReviewTitle": "Giants clams",
      "Review": "We went snorkling. Beautiful clams some of them a meter high. Different colours and big starfish. Our guide even picked a blow fish for us yo touch. Very friendly guides. Enjoyed it in full"
    },
    {
      "User": "R_Briz",
      "Location": "Makati, Philippines",
      "DateofReview": "February 7, 2017",
      "ReviewTitle": "Giant clams",
      "Review": "The sanctuary is good and the staff taking care of it are nice. Cost of transfer from a local boats is Php500, a bit pricy ."
    },
    {
      "User": "virmen",
      "Location": "Malaybalay City, Philippines",
      "DateofReview": "November 21, 2016",
      "ReviewTitle": "Giant Clam",
      "Review": "nice experience so far .. diving with the giant clams, hmmmm i might go back there soon with my friends"
    },
    {
      "User": "Michael A",
      "Location": "Davao City, Philippines",
      "DateofReview": "November 9, 2016",
      "ReviewTitle": "Leisure fun",
      "Review": "Can be done. However, you should bring your own flippers and diving glasses. Best at new moon or full moon when the low tide is really deep. Otherwise it is rather 3 meters to the animals."
    },
    {
      "User": "eatlivetraveldrink",
      "Location": "Washington DC, District of Columbia",
      "DateofReview": "October 27, 2016",
      "ReviewTitle": "Interesting activity",
      "Review": "This is an activity offered to the guests at Pearl Farm Resort - you go to this area in the water and fro there swim out to the shallows where you can see giant clams. Cool activity for water lovers."
    },
    {
      "User": "thess-rhina",
      "Location": "Muntinlupa, Philippines",
      "DateofReview": "July 20, 2016",
      "ReviewTitle": "Worth visit!! ",
      "Review": "Its worth the visit..going there is quite adventure..esp when riding a tricycle..nd u may contack (09468577160) yanyan(tricycle driver? )For ur adventure trip in samal island he is nice guy nd worth the price for tour in hagimit falls.taclobo islnd.bat cave for 1000pesos..and can nego if...More"
    },
    {
      "User": "Hồng Anh N",
      "Location": " ",
      "DateofReview": "July 14, 2016",
      "ReviewTitle": "Interesting Ecotourism!!!",
      "Review": "Giant clams are endangered species and need protection. Through Taklobo tours in Giant Clam Sanctuary in Samal island, you can see real giant clams in wild and enjoy their unique beauty and their colorful mantle. Most of them are hatched successfully in giant clam hatchery....More"
    },
    {
      "User": "Kaye P",
      "Location": " ",
      "DateofReview": "July 11, 2016",
      "ReviewTitle": "Must visit ",
      "Review": "The guys in charge of this place are very nice. You should visit this so you can help preserve the place. We snorkel saw the clam that is 1Meter long. It's fascinating to see them. Don't forget to bring cash for tip."
    },
    {
      "User": "Atila E",
      "Location": "Izmir, Turkey",
      "DateofReview": "June 10, 2016",
      "ReviewTitle": "Must visit",
      "Review": "To rqach this place is rather expensive and time consuming but it is worth. You must see these giant clams . You get good info about clams here."
    },
    {
      "User": "Munky08",
      "Location": "Pasig, Philippines",
      "DateofReview": "June 1, 2016",
      "ReviewTitle": "Unique experience",
      "Review": "I've had fun snorkelling around the area. Seeing those giant clams is a fulfilling experience. Totally recommended."
    },
    {
      "User": "John L",
      "Location": " ",
      "DateofReview": "May 22, 2016",
      "ReviewTitle": "Freedive with the giant clams",
      "Review": "We paid 100pesos for the entrance fee and I immediately jump in the water and follow the tour guide i brought snorkels with me and leave the lifejacket in the boat, i asked the guide to go down and go near the clam because it...More"
    },
    {
      "User": "jaritrip",
      "Location": " ",
      "DateofReview": "May 1, 2016",
      "ReviewTitle": "Interesting to know about giant clams",
      "Review": "I enjoyed the giant clams that arranged properly. Nice for educational tour especially for the student studying marine biologist. They preserved giant clams"
    },
    {
      "User": "JELN24",
      "Location": "Makati, Philippines",
      "DateofReview": "April 7, 2016",
      "ReviewTitle": "A Must See in Samal",
      "Review": "I first visited the Sanctuary last May 2015 and had a wonderful time so I returned with family last March 2016. Last time we went to the Sanctuary we took a boat for 500 pesos and paid 100 for the entrance and another 100 if...More"
    },
    {
      "User": "jblaza",
      "Location": "Marikina, Philippines",
      "DateofReview": "March 24, 2016",
      "ReviewTitle": "Snorkel alongside giant clams",
      "Review": "When we were doing our Samal Island Tour, we made sure to include the Giant Clam Sanctuary in our itinerary. It was well worth the trip.\r \r Prior to the trip, I contacted the Davao del Norte State College about the tour and they were very responsive. They even provided the mobile number of Mr. Xavier Lopez, the head of the Marine Station, for our queries.\r \r From the highway, our habal-habal entered a road and after several minutes of riding, we arrived in Brgy. Adecor. From the Barangay, there is a small wharf where a pump boat can be rented for Php 500, which is paid directly to the boat man; it is good for up to 6 pax and for up to 2 hours. The wharf offers a view of Malipano island and is situated between the Pearl Farm Resort and the Davao del Norte State College Marine Reserve Park where the giant clams are.\r \r (Although the boat man offered to take us around Malipano Island and to the Pearl Farm Resort for an additional Php 500, we opted not to due to time constraints.)\r \r There is a series of huts/rafters built inside the marine reserve park where the boat docks and a short orientation is conducted. The entrance fee is Php 100 per person. It was Ms. Rebecca who gave the orientation and she was happy to answer the questions that we had about the Marine Station and the giant clams. Although snorkels, rash guards, and underwater cameras were available for rent, we brought our own. Drinks (bottled water, soft drinks) are available at the marine station.\r \r After the orientation, we were assigned a guide who would bring us closer to the giant clams. Life vests were provided. We went during low tide and shallower water gave a better view of the clams. We were lucky that we went early and had the entire reserve for ourselves. The guides told us that during peak seasons, they only allow up to 35 pax inside the marine station at a time to prevent untoward incidents from happening (both to the guests and the clams).\r \r Initially, the guide tugged us using a floater. Eventually, we were snorkeling around on our own. Our guide was happy to show us the different species of giant clams in the marine station. Along the sand bar, you can get really close to the giant clams so be careful not to touch/hit them. They cautioned us to not get our appendage inside the clams as it would require killing the clam to open it up if part of the body gets stuck. They added that it has not happened to any guest yet, but we figured that we would rather not be the first. While chatting with the guides, we learned that they were all certified divers and had training for first aid and water rescue.\r \r After returning to the dock, I asked where they kept the young giant clams. Ms. Rebecca said that their office at the wharf served as a nursery, but it is not open to visitors because of biosecurity considerations. She added that the giant clams produced in the marine reserve are given out to the different marine sanctuaries within Samal Island. Nevertheless, we were able to take a peek inside the nursery when we returned to the wharf, albeit from outside the door.\r \r It was great to have a close encounter with these majestic creatures."
    },
    {
      "User": "Mariel G",
      "Location": "Baliuag, Philippines",
      "DateofReview": "March 15, 2016",
      "ReviewTitle": "Almost an hour boat ride was worth it",
      "Review": "It is high tide when we arrived in this place. The clams were very big and very great to look at. I really love this place. The guides were all patient enough to help us since we can't step on the clams while we are swimming."
    },
    {
      "User": "Leydee D",
      "Location": "Samal Island, Philippines",
      "DateofReview": "March 3, 2016",
      "ReviewTitle": "Natural and beautiful",
      "Review": "Unforgetable experience. I always make sure that my friends and family and guests too would be able to visit this place.. Simply amazing."
    },
    {
      "User": "Kates A",
      "Location": "Cavite City, Philippines",
      "DateofReview": "February 12, 2016",
      "ReviewTitle": "Informative and amazing experience",
      "Review": "We paid P1000 for the boat but we were told we can haggle down to just P500. We paid for the snorkeling gears rental, too. They built a wooden house in the middle of the water so they can be close to the sanctuary. Before you get to the water, a staff will discuss few information about the Taclobo and some precautionary instruction. There will be staff assigned per group in approaching the clams, you can either have a life vest, hold a life preserver or just swim.\r \r Its a big farm of giant clams! There are also colorful fishes and starfishes. You can't hold the Taclobo to prevent damaging them and bruising you so be careful. The staff assigned to us is very generous in entertaining us with the history of the Taclobos in Samal Island. Its very informative and we appreciated it. All staff are professional and friendly.\r \r What i love the most is they dont just treat the farm as a money cow for the tourists, they do really care and take care of the giant clams. That is a big plus!"
    },
    {
      "User": "Charleen C",
      "Location": "Manila, Philippines",
      "DateofReview": "February 11, 2016",
      "ReviewTitle": "It's okay",
      "Review": "The activity is just okay. Nothing exciting. The only thing unique is that you get to touch a giant clam. The guides and caretakers are very nice and knowledgable."
    },
    {
      "User": "Peter19502013",
      "Location": "Davao",
      "DateofReview": "January 7, 2016",
      "ReviewTitle": "Interesting , beautiful and educational",
      "Review": "During a day trip on boat the captain suggested a stop over here. It is really worthwhile to see. The clams and the corals are very beautiful. A good snorkelling stop over including some education about these giant clams. Before entering the water you listen to 5 minutes lecture which makes the whole experience more valuable. This is good for both adults and kids. "
    },
    {
      "User": "Grace H",
      "Location": "Quezon City, Philippines",
      "DateofReview": "January 5, 2016",
      "ReviewTitle": "Amazing experience!",
      "Review": "We visited Samal Island last November 2015 and as part of my bucket list, I \"NEED\" to see these giant clams!\r Going there is quite an adventure specially when you're riding a tricycle. By the way, we rented a trike for \r P1,500.00 which includes going to 4 other tourist destinations in the island. As we arrive at Adecor, Samal, you have to rent a boat for P500.00 (1 person to 10 max) which will bring you to the sanctuary. A tour guide will provide you a short introduction on the different kinds of clams you'll see underneath the ocean. There is a fee of P 100.00 (I guess for the maintenance or entrance) and another P 100.00 is you rent a snorkeling gear (which I guess is necessary unless you have your own) The guide/diver will tour you around while holding a floater explaining the kinds of clams underneath you. It was worth it!"
    },
    {
      "User": "RickN6900",
      "Location": "Los Angeles",
      "DateofReview": "December 8, 2015",
      "ReviewTitle": "Nice Snorkeling trip",
      "Review": "Spent an afternoon floating lazily along while viewing the giant clams in the bay. There are so many of different colors and sizes. Very nice for those who like to take photographs underwater."
    },
    {
      "User": "Morris Adelon A",
      "Location": " ",
      "DateofReview": "November 23, 2015",
      "ReviewTitle": "Giant Clams",
      "Review": "Swim to see the different kinds of taclobo as the locals calls it. Safe, fun and a really unique, new experience only in Samal. Enjoy the water and the sight. Caretakers are accomodating and friendly. Make sure to visit this place and help the locals and the NGOs in the conservation and preservation of this creatures before its too late."
    },
    {
      "User": "Dimple S",
      "Location": " ",
      "DateofReview": "September 28, 2015",
      "ReviewTitle": "Nature Unmatched",
      "Review": "Never miss the chance to see these one-of-a-kind creatures. They may not be originally from Davao (I learned that they were shipped from Bolinao) but they sure are at home in this sea. You will really appreciate the beauty of nature once you snorkel with them. There are beautiful fish as a bonus of this experience."
    },
    {
      "User": "Vanessa G",
      "Location": "Manila, Philippines",
      "DateofReview": "September 2, 2015",
      "ReviewTitle": "Unique Experience",
      "Review": "lots of giant clams and sea urchins. OK to go once and see the giant clams but its not worth going back."
    },
    {
      "User": "Alison T",
      "Location": "Singapore",
      "DateofReview": "July 23, 2015",
      "ReviewTitle": "Do not miss this activity.",
      "Review": "It was a great experience to see the giant clams. At first, we thought they were just big stones underneath the sea. We saw water snake too. Do not struggle and do not touch it. We really loved to see all the different fish, star...More"
    },
    {
      "User": "DingLacostales",
      "Location": "Manila, Philippines",
      "DateofReview": "July 10, 2015",
      "ReviewTitle": "Unique experience",
      "Review": "You can see the giant clams up close and even touch them. I know it pales in comparison if your doing any scuba diving and such but it's a pretty good experience."
    },
    {
      "User": "SGregersen",
      "Location": "Kalundborg, Denmark",
      "DateofReview": "July 4, 2015",
      "ReviewTitle": "Great snorkeling",
      "Review": "Great experience to snorkle on giant clams - the largest was 1,5 meter wide. After a dive on Diaz Wall nearby, we persuaded the captain to take us the sanctuary."
    },
    {
      "User": "vardkeem",
      "Location": "Cebu Island, Philippines",
      "DateofReview": "June 18, 2015",
      "ReviewTitle": "GIANT . . . .really, clams at least 2 feet",
      "Review": "memorable experience seeing those beautiful creatures underwater, really amazing. the fare to the sanctuary is expensive for group under 5 persons."
    },
    {
      "User": "Kim K",
      "Location": "Manila, Philippines",
      "DateofReview": "June 14, 2015",
      "ReviewTitle": "Protecting the clams",
      "Review": "I loved that the Philippinos are taking the preserving of the clam species seriously and are helping restore the protection of the ocean life"
    },
    {
      "User": "ronsdy",
      "Location": "philippines",
      "DateofReview": "March 27, 2015",
      "ReviewTitle": "top 2 best places to visit in Samal",
      "Review": "When in Samal this place the the coral garden area are the place place to visit and go for a swim. The people taking care of the clams are very knowledgeable and would share their passion for taking care of the clams."
    },
    {
      "User": "virmen",
      "Location": "Malaybalay City, Philippines",
      "DateofReview": "March 21, 2015",
      "ReviewTitle": "the place is quite nice for you to enjoy be sure to bring your own things for snorkeling",
      "Review": "the place is quite nice for you to enjoy be sure to bring your own things for snorkeling/i like the clams the tour guides as well they explain what happening there/."
    },
    {
      "User": "Laagankaayoko",
      "Location": "Iligan, Philippines",
      "DateofReview": "December 22, 2014",
      "ReviewTitle": "The Last of the Giants",
      "Review": "Best way to encounter this last of giants. They showed me a 19months old which a size of a 5peso coin. Don't know how old are those 1.5 meters length when you go there you can ask it for me to know. Best time to...More"
    },
    {
      "User": "RomanesinAsia",
      "Location": "Davao City, Philippines",
      "DateofReview": "November 26, 2014",
      "ReviewTitle": "Yes , they are GIANT !",
      "Review": "Feels good to see a place dedicated to preserve these incredibly huge and beautiful animals. Nice snorking for all the family, Very friendly guides. Easy to get there."
    },
    {
      "User": "rubberunethical",
      "Location": "Dubai",
      "DateofReview": "August 10, 2014",
      "ReviewTitle": "Clean thrilling swim",
      "Review": "Scorching hot out in mid-sea. Swam all around but saw clams fewer and far between than advertised in the hundreds."
    },
    {
      "User": "DrunkenDugong",
      "Location": "Davao City, Philippines",
      "DateofReview": "June 26, 2014",
      "ReviewTitle": "Snorkeling with Giant Clams",
      "Review": "The Giant Clam Sanctuary on Samal Island is an ongoing conservation project of the Davao del Norte State College and is open to visitors. It's a protected breeding colony of several species of giant clams, taklobo in the local language. Giant clams have been overfished...More"
    }
  ]
}